export default {
    tw: {
        home: "首頁",
        toast: ["査詢指令下發成功", "設定成功", "設定失敗", "該鏡頭不支持設定分辯率", "正在搜索,請稍等..."],
        picker: ["確認","取消"],
        carInfo: {
            label: ["車機D", "手機號碼", "車牌號", "車牌顏色",
                "區域代碼", "製造商編號", "VIN車架號", "車牌分類", "發動機號", "協定類型"],
            placeholder: [
                "請輸入車機ID", "請輸入手機號碼", "請輸入車牌號", "請輸入區域代碼",
                "請輸入製造商編號", "請輸入VIN車架號", "請輸入車牌分類", "請輸入發動機號"
            ],
            columns: "色,黃色,黑色,白色,綠色,黃綠色,漸變綠,其它",
            navTitle: "車輛資訊",

        },
        netWork3g4g: {
            label: ["啟用", "電話號碼", "接入點", "用戶名", "密碼"],
            placeholder: ["請輸入電話號碼", "請輸入接入點"
                , "請輸入用戶名", "請輸入密碼", "請輸入MTU"
            ],
            button: ["出廠設定"],
            navTitle: "數據網絡",
            note: "電話號碼是運營商提供的上網號,不是本機號"
        },
        actualTime: {
            title: [
                "名稱: 視頻狀態", "名稱：視頻輸入", "名稱：網絡狀態", "名稱：定位狀態"
            ],
            value: [
                "狀態：無", "狀態：無", "狀態: ", "狀態: "
            ],
            label: [
                "資訊：無", "資訊：無", "資訊: ", "資訊: "
            ],
            navTitle: "即時狀態",
        },
        alarm: {
            title: [
                "IO序號", "蜂鳴器啟用",
                "事件名稱", "延遲", "連拍張數", "啟用", "類型"
                , "上報類型", "抓拍模式", "連拍間隔"
            ],
            navTitle: "IO",
            start: ["不啟用", "啟用"],
            type: ["負觸發", "正觸發"],
            alarm: ["不上報", "正常", "緊急報警"],
            cameraType: ["單拍", "雙拍", "連拍"],
        },
        alarmInfo: {
            label: ["啟用", "蜂鳴器", "事件名稱", "類型",
                "延遲", "上報類型", "抓拍模式", "連拍張數", "連拍間隔", "協定類型","邏輯反","面切換通道","報警錄影通道號","抓拍通道號"],

            placeholder: ["請輸入事件名稱", "請輸入延時", "請輸入連拍張數", "請輸入連拍間隔"],
            logical: ["使能","不使能"],
            radio: ["正觸發", "負觸發"],
            columns2: "不上報,正常,緊急報警",
            columns3: "單拍,雙拍,連拍",
            channelTitle:"否",
            navTitle: "IO",
        },
        cameraInfo: {
            title: [
                "啟用", "分辯率", "水准鏡像", "垂直鏡像", "設定分辯率"
            ],
            navTitle: ["鏡頭 ", " 設定"],
        },
        cameraSettings: {
            title: [
                "視頻制式"
            ],
            navTitle: "鏡頭設定",
        },
        demarcate: {
            button: [
                "ADAS標定", "BSM1標定", "BSM2標定", "結束嚮導"
            ],
            navTitle: "遠程標定",
        },
        diskStatus: {
            title: [
                "名稱", "磁片狀態", "總容量", "剩餘容量", "格式化","使用狀態"
            ],
            diskStatusLang:"--,未鎖,無,--,未格式化,格式化中,未使用,錯誤,已滿,覆蓋,錄影中,正常",
            navTitle: "磁片",
            load: "格式化...",
            alert: ["提示", " 指令已下發, 請查看車機是否開始格式化 "],
            alertMsg: ["無效","格式化中...","格式化成功"],
            stateName: "未鎖,無,未格式化,异常,正常",
            tipsConfirm: "確認",
        },
        platformSettings: {
            title: [
                "伺服器", "伺服器IP", "伺服器端口", "伺服器狀態", "車機狀態"
            ],
            navTitle: "平臺配寘",
            deviceState: ["離線,上線,授權過期,受限,衝突,無效,未啟用"],
            serveState: ["啟用", "禁用", "未啟用"],
            logonState: ["啟用", "禁用", "未啟用"],
        },
        platformStatus: {
            title: [
                "平臺 ", "伺服器IP / 域名", "伺服器端口", "是否啟用", "注册"
                , "協定類型", "平臺類型", "地方標準","車機狀態"
            ],
            navTitle: "平臺",
            columns3: "808標準協定平臺,通天星,三一,星冠,超越,雲科,東莞億程,中車,廈門瑞訊",
            columns4: "江蘇,廣東,新川標,陝西",
            deviceState: ["離線,上線,授權過期,受限,衝突,無效,未啟用"],
            serveState: ["啟用", "禁用", "未啟用"],
            logonState: ["啟用", "禁用", "未啟用"],
        },
        rotaTestNsor: {
            title: [
                "啟用", "類型", "邏輯反", "脈衝檢測週期", "狀態"
                , "協定類型"
            ],
            placeholder: [
                "請輸入脈衝檢測週期"
            ],
            radio: [
                "啟用", "關閉"
            ],
            navTitle: "正反轉感測器",
            columns2: "三點磁觸式,脈衝AD式,單點磁吸式",
            columns3: "停止,正轉,反轉",
        },
        serveInfo: {
            title: [
                "啟用", "注册", "IP/域名", "端口", "協定類型"
                , "平臺類型", "地方標準","車機狀態"
            ],
            placeholder: [
                "請輸入IP/域名", "請輸入端口"
            ],
            radio: [
                "自動", "手動"
            ],
            navTitle: "伺服器 ",
            columns3: "808標準協定平臺,通天星,三一,星冠,超越,雲科,東莞億程,中車,廈門瑞訊",
            columns4: "江蘇,廣東,新川標,陝西",
            errorMsg: " IP/域名 不能為中文",
        },
        settingsIP: {
            title: [
                "啟用", "WIFI名稱", "密碼", "IP 類型", "IP 地址"
                , "子網路遮罩", "預設閘道", "DNS", "DNS伺服器", "確認"
            ],
            button: [
                "搜索"
            ],
            placeholder: [
                "請輸入WIFI名稱", "請輸入密碼", "請輸入IP地址", "請輸入子網路遮罩"
                , "請輸入預設閘道", "請輸入DNS伺服器",
            ],
            radio: [
                "動態", "靜態", "動態DNS", "靜態DNS"
            ],
            navTitle: "設定WIFI",
            connectState: "--,禁用,已連接,未連接",
            itemList: ["wifi名稱: ", "是否需要密碼: "],
            errorMsg: " WIFI名稱 不能為中文",
        },
        systemInfo: {
            navTitle: "車機",
            cellList: "車機型號,車機序號,硬體版本號,軟件版本號,MCU版本號,授權,製造商名稱,模塊型號,模塊版本資訊,模塊SN號,SIM卡IMSI,GPS模塊資訊,（ADAS）產品代號,硬體版本號,軟件版本號,車機ID,ADAS狀態,DSM狀態,授權狀態,運行狀態,定制狀態",
        },
        wifiSettings: {
            title: [
                "啟用", "模塊類型", "序號", "WIFI名稱", "狀態"
            ],
            navTitle: "WIFI設定",
            modelValue: "檢測中…,已授權,未授權",
            warrantValue: "檢查中,無模塊,2.4G",
            wifiStatus: "--,禁用,已連接,未連接",
        },
        newWork: {
            columns: "無,定位中,鎖定,天線拔出,天線短路,外部GPS上線,外部GPS异常,出錯！ 檢測中,無模塊,未授權,有！ 未連接,連接！ 斷電,無模塊,檢測中,异常,LTE,EVDO,WCDMA！ 斷電,有-鎖定正常,有-鎖定受限,無,有,异常！ 斷電,無,弱,中,强！ 斷電,連接,未連接,注册失敗,撥號失敗,撥號中！ 以太網,WIFI,3G,4G,2G,無！ 無,上線,離線！ 離線,上線,授權過期,受限,衝突,無效,未啟用",
            titleColumn: "GPS,WIFI模塊,WIFI狀態,模塊類型,SIM卡,3G/4G訊號,撥號,網絡類型,視訊伺服器,衛星數",
            navTitle: "網絡",
            serverName: "環保機伺服器 "
        },
        adas: {
            label: [
                "車輛寬度", "鏡頭到車輛左側距離", "鏡頭安裝高度", "鏡頭到車頭保險杠距離"
            ],
            placeholder: [
                "請輸入車輛寬度", "請輸入距離", "請輸入寬度", "請輸入距離"
            ],
            button: "開始標定",
            navTitle: "ADAS標定",
        },
        dsm: {
            button: ["DSM1 標定", "DSM2 標定"],
            dialog: [
                "提示",
                "退出嚮導模式,請點擊確認,如果還需設定其他功能,請點擊取消",
                "確認","取消"
            ],
            navTitle: "DSM 標定",
        },
        oilParam: {
            label: [
                "當前油位", "當前油量", "類型", "報警閾值"
                , "標定數目", "總容量", "感測器最大值"
            ],
            placeholder: [
                "請輸入當前油位", "請輸入當前油量", "請輸入報警閾值"
                , "請輸入標定數目", "請輸入總容量", "請輸入感測器數據最大值"
            ],
            title: "類型",
            navTitle: "油感感測器"
        },
        popupCheckbox: {
            button: [
                "取消", "確認"
            ],
        },
        stickyBottom: {
            button: [
                "上一步", "保存", "下一步", "査詢", "保存","完成嚮導"
            ],
            
            toast: "沒有更多了~"
        },
        tab: {
            leftText: "返回",
            rightText: "Log",
            dialog: [
                "提示",
                "結束嚮導,請點擊確認,如果還需設定其他功能,請點擊取消. ",
                "確認","取消"
            ],
        }
    },
}
