
export default  {
    fileError:["Имя задачи загрузки файла такое же"],
    dialogTitle: [" подсказка "," поиск "," сортировка "," модернизация "],
    commonLabel: ["Новый", "Запрос"],
    settingStr:"настраивать",
    leaf:["Гос.Номер", "Время GPS", "Скорость", "Пробег", "Местоположение", "Статус ACC", "Работа автомобиля", "Тревога"],
    OnlineState:["В сети", "Не в сети"],
    menu:["Китайский","Английский","Русский"],
    allSelect: "Выбрать все"
    ,allNotSelect:"Инвертировать выделение"
    , remove:"Очистить",
    serviceLockTitle: "Блокировка сервера",
    login:{
        language : "Язык",
        userName : "Имя пользователя",
        passWord : "Пароль",
        btnLogin : "Войти сейчас",
        WelCome : "Добро пожаловать",
        windowsVersion : "Версия Windows",
        iosVersion : "версия iOS",
        androidVersion : "Версия Android",
        versionUpdateTime : "Обновить",
        Download : "Скачать",
        isNull:"Не может быть нулевым"
    },
    videoLive:{
        full:"Полный экран"
        ,allClose:"Закрыть все"
        ,streamMan:"Основной поток"
        ,streamMin:"Дополнительный поток"
        ,stream:"Тип потока"
        ,Switch:"Переключатель"
    },
    common:{
        appNameLabel: "SimbaVMS"
        ,logOut: "Вы хотите выйти из системы?"
        ,homePage:"Главная"
        ,Logout:"Выход"
        ,updatePassword:"Изменить пароль"
        ,numberStr:"Оконечный"
        ,VehicleID:"Гос.Номер"
        ,search:"Поиск"
        ,status:[" нормально "," отключено "," стоп "," стоп "," стоп "," стоп "," стоп "]
        ,AlarmInfo:"Тревога"
        ,gpsNumber:"GPS-сигнал"
        ,AlarmVideo:"Потеря видео"
        ,AlarmVideo_:"Перекрытие видео"
        ,AlarmDisk:"Тревога диска"
        ,serviceTime:"Время получения"
        ,carStatus:"Статус ACC"
        ,speedStr:"Скорость"
        ,Status:"Статус"
        ,number:"Число"
        ,TerminalID:"ID устройства"
        ,companyStr:"Компания"
        ,TerminalType:"Тип терминала"
        ,menufactorId:"ID производителя"
        ,SIMNumber:"ICCID"
        ,HardWareVersion:"Версия оборудования"
        ,softwareVersion:"Версия прошивки"
        ,MCUVersion:"Версия MCU"
        ,WirelessModule:"WiFi Модуль"
        ,adas:"DSM/ADAS"
        ,AlarmGNSS:"Статус антенны"
        ,alarmStr:"Аварийный сигнал, сигнал о превышении скорости, усталость от вождения, предупреждение об опасности, отказ модуля GNSS, антенна GNSS не подключена или отключена, короткое замыкание антенны GNSS, пониженное напряжение основного питания терминала, сбой основного питания терминала, отказ ЖК-дисплея или дисплея терминала, Отказ модуля TTS, отказ камеры, отказ модуля IC-карты сертификата дорожного транспорта, предупреждение о превышении скорости, предупреждение об усталости от вождения, совокупное время вождения в течение дня, сверхурочная парковка, въезд и выезд на территорию, въезд и выезд с маршрута, недостаточно /слишком долгое время движения по дороге, сигнализация об отклонении от маршрута, сбой VSS транспортного средства, ненормальный уровень топлива транспортного средства, угон транспортного средства, незаконное зажигание транспортного средства, незаконное перемещение транспортного средства, предупреждение о столкновении, предупреждение о переворачивании, сигнализация о незаконном открытии двери, 1,1"
        ,RecordType:["Все записи", "Основной поток", "Дополнительный поток"]
        ,streamLabel:["Основной поток","Дополнительный поток"]
        ,diskErrStr:["Сбой жесткого диска", "SD-карта 1 не работает", "SD-карта 2 не работает"]
        ,tabsMap:["Информация о треке", "Анализ треков", "Монитор скорости", "Анализ превышения скорости", "Статус ACC", "Статус 3G/4G"]
        ,imagePlay:"Предварительный просмотр изображения"
        ,OnlineDateTime:"Время входа в систему"
        ,OnlineState:["В сети", "Не в сети"]
        ,rec:"Запись"
        ,fileType:"Тип файла"
        ,promptTitle:"Приглашение"
        ,successUpdate:"Обновление выполнено успешно"
        ,successError:"Обновление не удалось"
        ,AdvancedSearch:"Расширенный поиск"
        ,more:"Больше"
        ,VehicleAccess:"Канал"
        ,selest_format:"Формат"
        ,StorageLocation:"Место хранения"
        ,uploadServer:"Загрузить FTP"
        ,hide:"Скрыть"
        ,IO:"Канал ввода-вывода"
        ,IOTime:"Месяц"
        ,ServerSearch:"Поиск сервера"
        ,deviceSearch:"устройство"
        ,dateTree:"Дата"
        ,StartCalendar:"Начать календарь"
        ,timeFrame:"Временные рамки"
        ,deviceType:["устройство", "сервер"]
        ,Record:"Тип записи"
        ,locationStr:["не находится", "позиция"]
        ,RecordTypeAll:["Все", "Канал"]
        ,AlarmType:"Тип тревоги"
        ,AlarmTypes:["Все записи", "Ручная запись", "Автозапись"]
        ,fileSize:"Размер файла"
        ,duration :"Продолжительность"
        ,action:"Действие"
        ,deviceName:"Имя устройства"
        ,fileSattus:["Загрузка", "Устройство не загружается", "Пауза", "Продолжить", "Отмена", "Успех", "Ожидание ответа"]
        ,deviceView:"Отобразить на экране"
        ,tts:"Звуковое оповещение(TTS)"
        ,devicesCmd:["Отобразить на экране", "Звуковое оповещение(TTS)"]
        ,closeVideoStr:"Сначала закройте видео"
        ,upload:"Загрузить"
        ,searchAll:"Поиск"
        ,submit:"Подтвердить"
        ,time:"Время GPS"
        ,upgradeTypeStr:["Обновление прошивки", "Обновление MCU", "Беспроводное обновление", "Обновление DSM/ADAS", "Файл конфигурации", "Файл авторизации"]
        ,stateStr:["Задача не выполнена", "Обновление выполнено успешно", "Устройство не ответило", "Обновление не удалось"]
        ,addWorkStr:"Добавить"
        ,ref:"Обновить"
        ,workName:"Имя задачи"
        ,workTime:"Время задачи"
        ,fileName:"Имя файла"
        ,relDevice:"Связанное устройство"
        ,updateSuccess:"Успех"
        ,updateFail:"Ошибка"
        ,updateRunFail:"Не удалось выполнить"
        ,deviceFail:"Устройство не отвечает"
        ,cmdSattus:"Устройство не в сети"
        ,type:"Тип обновления"
        ,versionNumber:"Номер версии"
        ,rel:"Ассоциация"
        ,relYes:"Связано"
        ,relNot:"Не связан"
        ,relCancel:"Отменить ассоциацию"
        ,relTitleYes:"Вы уверены в ассоциации?"
        ,relTitleNot:"Удалить связь?"
        ,download:"Скачать"
        ,del:"Удалить"
        ,reset :"Сброс"
        ,group:"Группа"
        ,deviceId:"ID устройства"
        ,deviceModeStr:"Модель"
        ,hd:"Аппаратная версия"
        ,sw:"Версия прошивки"
        ,mcu:"MCU"
        ,wifiStr:"Wi-Fi"
        ,run:"Выполняется статус"
        ,runNot:"Устройство не запущено"
        ,listNull:"Нет записей"
        ,loginTitle:"Логин"
        ,loadingStr:"Загрузка"
        ,oldPassword:"Старый пароль"
        ,newPassword:"Новый пароль"
        ,confirmPassword:"Подтвердить пароль"
        ,previousStr:"Предыдущая страница"
        ,nextStr:"Следующая страница"
        ,dataTypeStr:["Да", "Нет"]
        ,onffStr:["ACC вкл", "ACC выкл"]
        ,updateStr:"Обновить"
        ,updateTypeStr:"Тип обновления"
        ,fileAddressStr:"Адрес файла"
        ,btnStatus:["Подтвердить", "Отмена"]
        ,cmdSendStr:"Отправить успешно, ожидая подтверждения устройства"
        ,settingsStr:"Настройки"
        ,timeMaxStr:"Время начала не может быть больше времени окончания"
        ,passWordFail:"Ошибка модификации!"
        ,DeleteSuccess:"Успешное удаление"

        ,CarNotNUll:"Пожалуйста, выберите автомобиль"

        ,closeVIdeoLoadingStr:"Закрытие"

        ,StrIsNUll:"Не может быть нулевым"

        ,passWordStr:"Пароли не совпадают"

        ,speedArrayStr:['Максимальная скорость', 'Минимальная скорость']

        ,contentisNull:["Содержимое не может быть пустым", "Содержимое не может быть больше 1024"]

        ,SinglePointSpeeding:["Ускорение одной точки"]
        ,treeSetting:["настройка параметра", "настройка параметра (обычно используется)"]
        ,settingsCarColor:["Синяя карта@0", "Желтая карта@1", "Черная карта@2", "Белая карта@3", "Зеленая карта@4", "Желтая карта@5", "Другое@6 "]
        ,settingsTypes:["Автоответ@0", "(ACC)-ВКЛ Автоответ/ВЫКЛ Ручной ответ@1"]
        ,settingsPhoto:["1@1", "2@2", "3@3", "4@4", "5@6", "6@6", "7@7", "8@8 ", "9@9", "10@10"]

        ,settingPar:["Настройка параметра регистрации", "Идентификатор провинции", "Идентификатор города", "Номер номера", "Цвет номерного знака", "Настройка параметра ссылки на терминал", "Интервал отправки пульса терминала", "Ответ сообщения TCP Время ожидания", "Время повторной передачи сообщения TCP", "Время ожидания ответа на сообщение UDP", "Время ожидания повторной передачи сообщения UDP", "Время ожидания ответа на SMS-сообщение", "Время повторной передачи сообщения SMS"]
        ,settingParFilter:["(0~65535)", "(менее 10 цифр)", "(0~999999)(секунд)", "(0~999999)"]

        ,sendStr:"Послать"
        ,cmdCopy:"Копировать"

        ,copyStr:"Копирование выполнено успешно"
        ,searchStr:"Запрос"

        ,cmdTable:["оборудование", "оператор", "время отправки", "контент"]

        ,tabDevices:["Обновление", "Блокировка устройства", "Загрузка видео", "Управление учетной записью", "Загрузка фото", "Сервер", "Поиск по файлам", "Поиск по ТС", "Удаление", "Управление FTP", "Приоритет", "Сервер управления FTP"]

        ,addIp:"Добавить"

//,streamLabel:[languageTL.videoLive.streamMan, languageTL.videoLive.streamMin]

        ,lockCarAll:"Заблокировать все автомобили"

        ,serverArrayStr:["Главный сервер 1", "Главный сервер 2", "Главный сервер 3", "Главный сервер 4", "Главный сервер 5", "Главный сервер 6", "Главный сервер 7", "Главный сервер 8"]

        ,statusStopStart:["включено", "не включено"]

        ,statusLock:["заблокировано", "разблокировано"]

        ,statusStatusStr:["отключить", "включить"]

        ,statusRegisterStr:["Зарегистрирован", "Не зарегистрирован"]

        ,versionLabel:["Протокол 2013", "Протокол 2019"]

        ,table_ip:["Тип сервера", "Статус блокировки", "Статус включения", "Тип протокола", "IP (имя домена)", "Порт", "Сервер", "Использовать стандартный", "Расширенный протокол", "Удаленная настройка", "Авторегистрация"]

        ,deviceAlarmStr:"Подтвердить операцию"

        ,saveStr:"Установить"

        ,ftpAddLabel:["Тип видео", "Адрес сервера", "Настройки файла", "Период даты", "Начало загрузки", "Конец загрузки","До тревоги (сек)","После тревоги (сек)", "Канал", "Сеть", "Тип потока", "Служба FTP", "Правила"]

        ,selectStatusLabel:["каждый день", "начинается в", "заканчивается в", "диапазон времени"]

        ,connectLabel:["WIFI", "Ethernet", "3G/4G"]

        ,deviceTypeLabelYes:["применяется к легковым автомобилям", "применяется к транспортным средствам с опасными грузами", "применяется к обычным грузовым автомобилям", "применяется к арендованным автомобилям", "поддерживает запись видео на жесткий диск", "разделенная машина"]
        ,deviceTypeLabelNo:["Неприменимо к легковым автомобилям", "Неприменимо к транспортным средствам с опасными грузами", "Неприменимо к обычным грузовым автомобилям", "Неприменимо к арендованным автомобилям", "Не поддерживает видео с жесткого диска", "Все- в одной машине"]

        ,deviceGNSSLabelYes:["Поддержка GPS", "Поддержка Beidou", "Поддержка ГЛОНАСС", "Поддержка GaliLeo"]
        ,deviceGNSSLabelNo:["Не поддерживает GPS", "Не поддерживает Beidou", "Не поддерживает ГЛОНАСС", "Не поддерживает GaliLeo"]

        ,deviceConnectLabelYes:["Поддержка GPRS", "Поддержка CDMA", "Поддержка TD-SCDMA", "Поддержка WCDMA", "Поддержка CDMA2000", "Поддержка TD-LTE", "Поддержка других способов связи"]
        ,deviceConnectLabelNo:["Не поддерживает GPRS", "Не поддерживает CDMA", "Не поддерживает TD-SCDMA", "Не поддерживает WCDMA", "Не поддерживает CDMA2000", "Не поддерживает TD-LTE", "Не поддерживает другие способы связи"]

        ,gnssLabel:"Свойства модуля GNSS"

        ,connectStr:"Свойства модуля связи"

        ,deviceTypeLabel:"Тип терминала"

        ,errorPermen:["Не поддерживается", "Нет разрешения"]

        ,promptContentNumber:"Вы выбрали [*] автомобиль, вы уверены?"

        ,contentStr:"Просмотр"

        ,statisticsTimerUploadResponseCols:["Оператор", "Время работы", "Связанное устройство", "Успех", "Отказ"]

        ,logTable:["оператор", "время работы", "выбрано", "результат", "содержимое", "действующее время"]
    },
    homePage:{
          searchDevice:" Устройства",
          weizhi : "Карта"
        , navideo : "Видео"
        , playback : "Воспроизве"
        , cmd : "Отправить"
        , userStr : "Управление"
        , testTitle : "Тестовый"
        ,setCommand : "Анализ"
        ,tabFtp : "Загрузить"
        ,server : "Управление"
        ,historyMap:"Маршрут"
        ,testAlarm : "Статистика"
        ,rule: "Управление"
        ,imagePlay:"Предварительный просмотр изображения"
        ,bottomTabs:["Статус устройства", "Информация о тревоге", "Тревога диска", "Тревога антенны", "Потеря видео", "Информация об устройстве"]
        ,version:"Обслуживание"
    },
    zh: {
         fieldTable: "Ячейка таблицы"
        , carIsNull: "Выберите сервер"
        , allSelect: "Выбрать все"
        , allSelectNot: "Отменить все выделение"
    },
    treeList:{
          FtpServer:"FTP-сервер"
    }
    ,videoTitle:"Пожалуйста, закройте окно воспроизведения видео"
    , tableSelect: ["Код авторизации", "SN", "Информация об авторизации", "Идентификатор клиента", "Язык", "Срок действия", "Время блокировки", "Сервер авторизации"]
    , time: "Время"
    , isPreView: "Предварительный просмотр видео"
    , isGps: "GPS"
    , statusStr: ["Закрыть", "Открыть"]
    , timeDate: "Время"
    , carList: "Список автомобилей"
    , addFtpStr: ["Нормальная видеозапись", "Тревога"]
    , logTableType: ["успех", "сбой", "устройство не в сети", "ошибка сообщения", "не в сети", "не поддерживается", "нет разрешения", "информация о сервере", "удаленная настройка", "транспортное средство информация", "Информация SIM"]
    , ztreeStr: ["Конфигурация загрузки видео", "Обычное видео", "Тревожное видео", "Статистика","","",""]
    , timeForever: "навсегда"
    , timeStart: "Текущий"
    , actionTime: "Установить время успеха"
    , carOffline: "Автомобиль не в сети"
    , attr: "Атрибут"
    , startPage: "На страницу"
    , endPage: "Страница"
    , confirm: "ХОРОШО"
    , btnStatus: ["Подтвердить", "Отмена"]
    , versionUpdate: "История"
    , authCloseStr: "Скрыть сервер"
    , authStr: "Настройки контроля учетных записей"
    , SettingAuth: "Главный сервер эксплуатации и обслуживания"
    , setting: "Настройки"
    , settingCan: "Отменить контроль учетных записей"
    , outhSelect: "Запрос контроля учетной записи"
    , select: "Запрос контроля учетной записи"
    , outhCount: "Статистика авторизации"
    , typeCheck: "Выберите тип"
    , serviceArray: ["Блокировать сервер", "Изменить сервер", "Статистика блокировки сервера", "Статистика блокировки автомобиля"]
    , outXls: "Импорт ТС"
    , outXlsDemo: "Загрузка шаблона"
    , taskTime: "Время действия задачи:"
    , taskTimeArray: ["одна неделя", "две недели", "три недели", "четыре недели", "навсегда"]
    , selectCar: "Выбран <span style='font-size:30px;font-weight:600;color: red;'>@</span>автомобиль"
    , selectCarNumber: "Выбран автомобиль <span style='color: red;'>@</span>"
    , lockStatus: "Статус блокировки:"
    , enableStatus: "Включить статус:"
    , lockArray: ["Разблокированный IP-адрес:", "Заблокированный IP-адрес:"]
    , serviceStr: "Главный сервер"
    , lockSettingStr: "Не установлено"
    , updateFileName: "Файл обновления"
    , updateName: "Имя:"
    , updateLoad: "Пожалуйста, выберите файл для загрузки!"
    , carAttr: "Информация ТС"
    , number: "Число"
    , statusLockCountArray: ["Заблокировано", "Включено", "Включено, Не заблокировано", "Заблокировано, Не включено"]
    , server: "Сервер"
    , port: "Порт"
    , actionCar: "Вы обязательно выбрали @Car"
    , loginStatus: "Сервер отключен"
    , validTime: "Статистика достоверности"
    , selectPublic: "Запрос"
    , serviceArrayTitle: ["Главный сервер 1", "Главный сервер 2", "Главный сервер 3", "Главный сервер 4", "Главный сервер 5", "Главный сервер 6", "Главный сервер 7", "Главный сервер 8 "]
    , apiType: "Тип протокола"
    /*
    * @version 1.1.0
    * @LastUpdate 2023/04/07
    * @author taoshunqian
    */
    , imagesDispose: [
        ["Настройка сервера","Тип изображения","Канал IO","Сеть","Время фотографий","Время загрузки"],
        ["WIFI","Эфир","3G/4G"],
        ["(Имя стратегии, по умолчанию может быть пустым)","Выбран","Машины"],
        ["Выберите хотя бы одну машину.","Стратегия выпуска удалась.","Провал стратегии",
            "Выберите хотя бы одну стратегию.","Пожалуйста, выберите стратегию.",
            "Пожалуйста, выберите машину.","Ошибка удаления стратегии"],
        ["Изменить политику","Добавить стратегию"],
        ["Настройка политики@dispose","Доступ@get","Добавить@add","Изменения@update","Удалить@delete"]
    ]
    , addImages: [
        ["Настройка сервера не может быть пустой","Я не могу быть пустым.","Время загрузки не может быть пустым","Добавить успех","Изменение успешно"],
        ["Добавить стратегию","Изменить политику"],
        [
            "Настройка сервера@serveice",
            "Время захвата@capture",
            "Режим даты@dateType",
            "Все даты@allDate",
            "До@asOf",
            "Начинается с@startOf",
            "Сроки@timeFrame",
            "Дата@date",
            "Период времени@timeSlot",
            "Период загрузки@uploadTimeSlot",
            "Сеть@network",
            "Эфир@Ethernet"
        ]
    ]
    , imgUpdateQuery: [
        ["Название стратегии","Содержание операции","Общее количество ассоциированного оборудования","Количество успешно ассоциированных устройств",
            "Количество устройств, не имеющих связи","Количество связанных невозвращенных информационных устройств","Оператор","Время работы"],
        ["Тип изображения","Канал IO","Сеть","Время фотографий","Время загрузки"],
        ["Номер машины.","Идентификатор устройства","Время приема оборудования"],
        ["WIFI","Эфир","3G/4G"],
        "Подробности"
    ]
    /*
     * @version 1.1.0
     * @LastUpdate 2022/02/10
     * @author taoshunqian
     */
    , cmd: {
        treeCmd: "Отправить запрос",
        // clickTab.js
        remoteConfig: "Удаленная настройка",
        titleCHStr: "Канал",
        storeStr: ["HDD@1", "SD1@2", "SD2@3", "Аварийное восстановление@4"],
        settingModeStr: ["Настройка режима", "Формат видео", "Разрешение"],
        // настройки режима
        settingSelectModeTypeStr: ["система PAL@0", "система NTSC@1"],
        settingSelectModeStr: ["960H@1", "720P@2", "1080P@3", "TVI 720@4", "TVI 1080P@5", "CVI 720P@6",
            "CVI 1080P@7", "960P@8"
        ],
        settingSelectViewStr: ["Плохо@0", "Плохо@1", "Удовлетворительно@2", "Хорошо@3", "Очень@4", "Лучше@5"],
        streamStr: ["Канал", "Наложение аудио", "Разрешение", "Частота кадров", "Тип скорости передачи", "Скорость передачи", "Качество", "Стандарт кодирования"],
        videoType: ["H264@0", "H264+@1", "H265@2", "H265+@3"],
        intro: ["Нажмите на ТС справа, чтобы получить информацию", "Нажмите, чтобы просмотреть сгенерированную команду", "Проверьте ТС справа, чтобы отправить его", "Отобразите сгенерированную команду"],
        introJs: ["Предыдущий", "Следующий", "Пропустить", "Конец"],

        // Главный сервер
        serverTest_setting1: ["Настройки сервера", "Адрес сервера", "Порт сервера", "Открыть сервер", "Автопереключение"],
        serverTest_setting2: ["Личный тест"],
        serverTest_settingTlServer: ["Главный сервер1@$Test1", "Главный сервер2@$Test2", "Главный сервер3@$Test3", "Главный сервер4@$Test4", "Главный сервер5@$Test5", "Главный сервер4@$Test6", "Главный сервер5@$Test7", "Главный сервер4@$Test8"],
        serverTest_settingServerStatus: ["Включить@1", "Отключить@0"],
        // установка системного времени
        serverTime_setting2: ["Настройка системного времени"],
        serverTime_setting1Filter: ["Формат описания: 2022,03,04,13,15,20"],
        serverTime_setting1: [
            // "год", "месяц", "день", "час", "минута", "секунда"
            "Системная дата", "Системное время", "Формат даты", "Синхронизация времени", "Выбор часового пояса", "Час", "Минута"
        ],
        serverTime_settingServerStatus: ["ГГГГ-ММ-ДД@0", "ММ-ДД-ГГГГ@1", "ДД-ММ-ГГГГ@2"],
        serverTime_settingServerStatus2: ["Нет@0", "Бейдоу@1"],
        serverTime_settingServerStatus3: ["Восточный часовой пояс@0", "Западный часовой пояс@1"],
        serverTime_settingServerStatus4: ["00@0", "15@1", "30@2", "45@3"],
        // Информация о транспортном средстве
        serverCar_settingCar: ["Информация о транспортном средстве", "Идентификатор терминала", "Номер мобильного телефона", "Номер номерного знака", "Цвет номерного знака", "Код города", "Номер производителя", "Номер кадра VIN", "Классификация номерного знака", "номер двигателя"],
        serverCar_settingServerStatus: ["Синий@1", "Желтый@2", "Черный@3", "Белый@4", "Зеленый@5", "Желто-зеленый@6", "Другой@9"],
        // Настройки звука
        serverAudio_settingAudio: ["Настройки звука", "Предварительный просмотр звука", "Усиление на входе", "Усиление на выходе", "Формат аудио", "бит/с", "Значение громкости TTS"],
        
        serverAudio_settingAduioFilte: ["0~10", "0~15"],
        serverAudio_settingSelectAudio: ["Вкл@1", "Выкл@0"],
        serverAudio_settingSelectAudio1: ["ADPCM@0", "IMA@1", "DVI4@2", "MG726@3", "G711A@4", "G711U@5", "G726@6"],
        serverAudio_settingSelectAudioBps: ["@0", "16K@1", "24K@2", "32K@3", "40K@4"],

        serverCameraMode_arr: ["Канал", "Включить"],

        /* ----------------------------------------2023/02/23 新增------------------------------------------------------------- */
        sensitivityState: [`Текущий алгоритм не включен, проверьте устройство "," (параметры скорости запуска / чувствительности) за пределами диапазона, пожалуйста, введите заново, а затем настроить`
            ,"Параметры выходят за рамки"],
        /* -------------------------------------------------------------------------------------------------------------------- */

        /* ----------------------------------------2022/11/29 新增------------------------------------------------------------- */
        // 算法关联 --》 基本设置
        AI2_settings_settingStatus: ["Включено@1", "Не включено@0", "Сохранить исходные настройки@2"],
        AI2_settings_title: "BSD Количество операций",
        //  基本设置
        AI_basic_settings_settingMode: ["Включить", "Скорость срабатывания", "Скорость сортировки", "Интервал тревоги", "Время срабатывания"],
        AI_basic_settings_settingStreamMain: ["Включить@1", "Закрыть@0"],
        AI_basic_settings_settingSelecStreamMain: ["Уровень 1@1", "Уровень 2@2", "Уровень 3@3"],
        AI_basic_settings_settingStatus: ["Включить@1", "Закрыть@0"],
        AI_basic_settings_settingSelectAudio: ["Высокий@3", "Входной@2", "Низкий@1","Не установлен@0"],


        // AI_basic_settings_adasConter: [
        //      "Угроза столкновения", "Тревога опасного сближения",
        //     "Съезд с полосы движения", "Угроза столкновения с пешеходом", "Тревога о смене полосы движения сплошной линией", "Тревога о препятствиях"],
        // AI_basic_settings_dsmConter: [ "Усталость", "Закрытие глаз", "Разговор по телефону",
        //     "Курение", "Отвлечение", "Ненормальное состояние водителя",
        //     "Закрытие камеры", "Фиксация DSM тревоги", "Смена водителя",
        //     "Фиксация IC события", "Уведомление о событии", "IC-карта заблокирована"],
        // AI_basic_settings_hodConter: ["Игра в телефон", "Ремень безопасности", "Руки не на руле"],

        AI_basic_settings_adasConter: ["Forward collision warning@0x01", "Lane departure alarm@0x02", "Alarm for too close distance@0x03",
            "Pedestrian collision alarm@0x04",  "Obstruction alarm@0x07", "Zebra crossing alarm@0x08"],
        AI_basic_settings_dsmConter: [
            "Fatigue driving warning yawn@0x01","Close eyes@0xFE","Call the police@0x02",
            "Smoking alarm@0x03","Distracted driving alarm@0x04", "Driver abnormal alarm@0x05",
            "Do not block the camera@0x07","Dsm capture event@0x10","Driver change@0x11",
            "IC capture event@0x12","Event notification@0x20","Infrared blocking@0x1F",
            "Mask@0xFB","drink water@0xFC","Fatigue blinking@0x09"
        ],
        AI_basic_settings_hodConter: ["play with the smarthphone@0x0D", "Without safety belt@0x0A", "Hands off the steering wheel@0x0C"],


        AI_basic_settings_content: [
            "ADAS Включен","Скорость срабатывания ADAS","км/ч (Диапазон 0-120км/ч)",
            "Предварительный просмотр наложения ADAS","чувствительность","DSM Включен","Скорость срабатывания DSM","км/ч (Диапазон 0-120км/ч)",
            "Окно предварительного просмотра","чувствительность","HOD Включен"
            ,"Скорость срабатывания HOD","км/ч (Диапазон 0-120км/ч)","Окно предварительного просмотра",
            "чувствительность","Поле отслеживания","Зона звуковой и визуальной сигнализации",
            "1 уровень тревоги","2 уровень тревоги","3 уровень тревоги","Связанный с BSD правый указатель поворота",
            "Уровень чувствительности","Скорость срабатывания тревоги"
            ,"Поле отслеживания","Зона звуковой и визуальной сигнализации","1 уровень тревоги","2 уровень тревоги","3 уровень тревоги",
            "Связанный с BSD правый указатель поворота","Уровень чувствительности","Скорость срабатывания тревоги"
        ],
        AI_basic_settings_basicState : ["ADAS sensitivity", "DSM sensitivity", "HOD sensitivity"],
        AI_basic_settings_sensitivityArr : ["high@0","in@1","low@2"],
        // 演示模式
        SimulatedModel_settingStatus : ["Войти в демо режим@1", "Выйти из демо режима@0"],
        SimulatedModel_title: 'Демо режим',

        // 模拟下发经纬度
        SimulatedLongitudeAndLatitude_content : ["Долгота и широта", "Нажмите на карту, чтобы узнать долготу и широту"],

        // 驾驶员识别
        AI_settings_settingsTitle: [
            ["Карта вставлена, распознавание лица", "голос"],
            ["ACC зажигание, распознавание лица", "голос"],
            ["Распознавание лица после ухода с поста", "голос"],
            ["Опрос по времени для распознавания лица", "Голос", "Интервал опроса"]
        ],
        AI_settings_title: "Идентификация водителя",

        //平台过滤
        pc_AI_o_srttings_settingStreamMain: ["Открыть@1", "Закрыть@0", "Уровень 1、2 тревоги совмещены и@2"],
        pc_AI_o_srttings_settingStreamMain2: ["Сигнализация ADAS", "Сигнализация DSM",
            "Сигнализация BSD", "Дисковые аномалии"],
        pc_AI_o_srttings_settingStreamMain3: ["Открыть@1", "Закрыть@0"],
        pc_AI_o_srttings_settingSelecStreamMain: ["Платформа 1 @1", "Платформа 2 @2",
            "Платформа 3 @3", "Платформа 4 @4", "Платформа 5 @5",
            "Платформа 6 @6", "Платформа 7 @7", "Платформа 8 @8"],
        pc_AI_o_srttings_content: ["Платформа","Фильтр платформ","AI Тревог",
            "Этот элемент помечен как закрытый, и все следующие поля не будут действовать",
            "Дисковые исключения не передаются в AI"],

        // 手动触发AI报警
        Manually_trigger_AI_alarm_settingStatus: [
            {
                text: "ADAS",
                arr: ["ADAS,0,0x01@Тревога лобового столкновения", "ADAS,0,0x02@Тревога выезда с полосы",
                    "ADAS,0,0x03@Тревога близкого расстояния", "ADAS,0,0x04@Тревога столкновения с пешеходом"
                    , "ADAS,0,0x05@Тревога частой смены полосы движения", "ADAS,0,0x07@Тревога препятствия",
                    "ADAS,0,0x10@Тревога распознавания знаков", "ADAS,0,0x11@Фиксация тревоги ADAS"]
            },
            {
                text: "DSM1",
                arr: ["DSM,0,0x01@Усталость за рулем, зевок", "DSM,0,0xFE@Закрытие глаз", "DSM,0,0x02@Разговор по телефону",
                    "DSM,0,0x03@Тревога курения", "DSM,0,0x04@Тревога отвлеченного вождения",
                    "DSM,0,0x05@Тревога ненормального водителя", "DSM,0,0x07@Не блокируйте камеру",
                    "DSM,0,0x10@Фиксация тревоги DSM",
                    "DSM,0,0x11@Смена водителя", "DSM,0,0x12@IC Фиксация тревоги", "DSM,0,0x20@Фиксация тревоги",
                    "DSM,0,0x1F@Блокировка камеры",
                ]
            },
            {
                text: "DSM2",
                arr: ["DSM,1,0x0A@Блокировка камеры", "DSM,1,0x0C@Руки не на руле", "DSM,1,0x0D@игра на смартфоне"]
            },
            {
                text: "BSD1",
                arr: ["BSD,0,0x03@Тревога слепой зоны"]
            },
            {
                text: "BSD2",
                arr: ["BSD,1,0x04@Тревога слепой зоны"]
            }
        ],

        // 设置模拟速度
        Set_simulation_speed_title: "Установить скорость симуляции",

        // 温度传感器
        thermometer_info_settings_content: [
            "Включить", "ID", "Имя", "Тревога верхнего предела температуры", "Верхний предел температуры", "Тревога нижнего предела температуры",
             "Нижний предел температуры", "Зуммер", "IO", "Частота отчетов"
        ],
        // 正反转传感器
        sensor_info_settings_settingStreamMain: ["Включить@1", "Закрыть@0"],
        sensor_info_settings_settingStreamMain2: ["Трехточечный магнитный сенсорный тип (высота)@0", "Импульсный AD (Yunke)@1", "Одноточечный магнитный всасывающий тип (Vivo)@2"],
        sensor_info_settings_settingStreamMain3: ["Стоп@0", "Стоп@1", "Разворот@2"],
        sensor_info_settings_content: ['Открыть ли', 'тип', 'логическое отрицание', 'цикл обнаружения импульса', 'тип'],

        // WIFI共享
        WIFI_share_settings_settingStreamMain: ["Включить@1", "Закрыть@0"],
        WIFI_share_settings_content: ["Открывать ли", "ESSID", "пароль", "Шлюз по умолчанию", "Маска подсети", "Адрес DNS-сервера"],

        // 录像部署
        video_deploy_settings_title: ["Включение самозаписи", "Видео отключения ACC"],

        // 短信设置
        message_settings_checkboxTitle: ["Автоматический ответ", "Белый список"],
        message_settings_settingStreamMain: ["Включить@1", "Закрыть@0"],

        // 图像设置
        coulomn_select_add_optionArr : ["на заказ", "стандартный", "холодный цвет", "теплый цвет"],

        special_output_settingStatus2: ["связь@0", "дальний диапазон@1", "Ручной@2"],
        special_output_settingStatus3:["Включен@1", "Не включен@0", " @-1"],
        special_output_arr:['Серийный номер', 'Пин-код', 'Шаблон', "состояние"],

        // 用户管理
        special_user_info_settings_arr: ["Серийный номер", "имя пользователя", "операция", "Максимальное количество пользователей"],
        special_user_info_settings_content: ["Добавить пользователя", "Изменить пароль", "удалить пользователя"],
        user_add_content: ["Добавить пользователя", "добавить в"],
        user_update_content: ["Изменить пароль", "изменить"],
        user_delete_content: ["удалить пользователя？", "подтвердить", "отменить", "удалить пользователя"],

        // 温度传感器列表
        special_thermometer_info_list_settings_settingStatus : ["Отключить@0", "Проиграть@1", "Нормально@2", "--@--"],
        special_thermometer_info_list_settings_arr: ["Номер", "ID", "Имя", "Текущая температура", "Состояние"],

        // 串口设置
        special_com_info_settings_arr: [
            ["300@300", "1200@1200", "2400@2400",
                "4800@4800", "9600@9600", "19200@19200",
                "38400@38400", "57600@57600", "115200@115200"],
            ["6-bit@6", "7-bit@7", "8-bit@8"],
            ["1-bit@1", "2-bit@2"],
            ["No чек@N", "Нечетный чек@O", "Четный чек@E"],
            ["ВАННА@0", "Нет8@1", "ЗАГЛУШКА@2", "Италия@3","Компания GX@4"],
            [
                "无@0", "透传@1", "云台@2", "油位@3", "TTS@4"
                , "AIS（视霸渔船定制）@5", "COMPASS（视霸渔船定制）@6", "LCD（航大）@7", "LED（航大）@8", "RFID刷卡器@9",
                "万航广告屏（通立）@10", "485串口协议的油位传感器@11", "LED闪烁灯（LED_M2）@12",
                "一拖三串口功能（AU100）@13", "华翰LED广告屏@14", "外接GPS数据@15", "通立标准通信协议@16",
                "角度传感器@17", "胎压@18", "中油瑞飞指定液位仪@19", "GPS数据透传@20",
                "本安行车记录仪@21", "计价器@22", "川基车顶灯（波特率19200）@23", "JD_LED(波特率19200)@24", "微视创LED（波特率9600）@25",
                "清研ADAS@26", "瑞为ADAS@27", "河南军工ADAS@28", "四川畅云@29", "指纹识别@30",
                "学生卡抓拍@31", "苏标ADAS@32", "云安ADAS@33", "深圳渣土车 LED@34",
                "深圳渣土车雷达@35", "超速报警器@36", "硕龙LED@37", "TRANSMIT2-透传到指定服务器@38",
                "TRANSMIT3-透传到指定服务器@39",
                "OpenProtocol 控制透传@40", "产测小板专用@41",
                "中车刷卡器@42", "图软设备@43", "部标机LCD测试@44", "顺禾设备@45", "雄帝读卡器@46",
                "串口打印保存至文件@47", "BSD声光报警器@48", "AAL100 声光报警器@49",
                "ACR100 刷卡器@50", "势航四方位客户显示屏@51", "载重传感器@52", "广州正安声光报警器@53", "深圳汽车电子刷卡器@54",
                "上海埃而生电气@55", "多合一声光报警器@56", "势航雷达@57", "长春骏达@58",
                "长春骏达客流计数器@59", "海南称芯合意@60", "赛格酒精检测@61", "亿程读卡器@62",
                "WIC磁条卡读卡器@63", "GBT_19056@64", "天地宏华酒精检测仪@65", "青岛宇新F3协议液位传感器@66",
                "内蒙旭一雷达@67", "湖北东讯温度传感器@68"
            ],
            ["Серийный номер порта", "Индекс настраиваемых функций", "Скорость передачи", "Длина данных", "Стоповый бит", "Проверка", "Тип уровня топлива"],
            ["IPC не обнаружен@0", "Отключено@1", "Не подключено@2", "Подключено@3", "Ничего@4"]
        ],

        // 输入
        special_input_settings_arr: [
            ["Включено@1", "Не включено@0"],
            ["1@1", "2@2"],
            ["нет@0", "AV1@1", "AV2@2", "AV3@3", "AV4@4", "опрос@5"],
            ["Аварийный сигнал@0", "нормальный@1", "Не сообщать@2"],
            ["AV1@1", "AV2@2", "AV3@3", "AV4@4"],
            ["Одиночный кадр@0", "Двойной кадр@1", "Непрерывная съемка@2"],
            ["Положительный триггер@1", "Отрицательный триггер@0"],
            ["Включено@1", "Не включено@0"],
            ["IO", "Зуммер", "Канал переключения экрана", "Название события", "Номер видеоканала тревоги",
                 "тип", "Логическое отрицание", "с задержкой", "Тип эскалации",
                 "Номер канала захвата", "Режим захвата", "Количество последовательных снимков", "Интервал серийной съемки"]
        ],

        // IPC
        special_IPC_settings_arr: [
            ["Включено@1", "Не включено@0"],
            ["загружать@1", "не загружать@0"],
            ["Серийный номер IPC", "Включить", "Статус подключения", "IP-адрес", "имя пользователя", "пароль"],
            ["IPC не обнаружен@0", "Отключено@1", "Не подключено@2", "Подключено@3", "Ничего@4"]
        ],

        // 定时抓拍
        special_timed_snapshot_arr: [
            ["Включено@1", "Не включено@0"],
            ["загружать@1", "не загружать@0"],
            ["№ Канала", "Включить", "Загрузить"]
        ],

        // 平台策略
        special_pc_AI_settings_arr: [
            ["Центр 0@0", "Центр 1@1", "Центр 2@2",
                "Центр 3@3", "Центр 4@4", "Центр 5@5"
                , "Центр 6@6", "Центр 7@7", "Центр 8@8"],
            ["ADAS@0", "DSM1@1", "DSM2@2", "BSD1@3", "BSD2@4"],
            ["Тревога 1 уровня@1", "Тревога 2 уровня@2"],
            ["открыть@1", "закрыть@0"],
            ["открыть@1", "закрыть@0"],
            ["Текстовая трансляция TTS@0", "Текстовая трансляция в формате PCM@1"],
            ["Управление@1", "Нет управления@0"],
            ["Выход 1@1", "Выход 2@0"],
            ["Канал 1@1", "Канал 2@2", "Канал 3@3",
                 "Канал 4@4", "Канал 5@5", "Канал 6@6", "Канал 7@7", "Канал 8@8"],
            ["ADAS@1", "DSM@2", "BSD@3"],
            ["генерировать@1", "не генерировать@0"],
            ["загружать@1", "не загружать@0"]
        ],
        special_pc_AI_settings_content: [
            "Платформа", "Платформа", "Уровень тревоги", "Уровень 1", "Уровень 2", "Уровень 3"
        ],
        special_pc_AI_settings_titleArr : [
            "Включить", "ID платформы для создания отчетов", "Интервал создания отчетов для платформы", "Интервал(ы) для создания отчетов о тревогах",
             "Аксессуары этого канала", "Количество загруженных изображений", "Документ о состоянии автомобиля (формат bin)", "Аксессуары канала расширения",
             "Канал расширения видео", "Канал расширения изображения", "Количество расширенных изображений"
        ],

        // 本地策略
        special_localhost_AI_settings_arr: [
            ["Центр 0@0", "Центр 1@1", "Центр 2@2",
                "Центр 3@3", "Центр 4@4", "Центр 5@5"
                , "Центр 6@6", "Центр 7@7", "Центр 8@8"],
            ["ADAS@0", "DSM1@1", "DSM2@2", "BSD1@3", "BSD2@4"],
            ["Тревога 1 уровня@1", "Тревога 2 уровня@2"],
            ["открыть@1", "закрыть@0"],
            ["открыть@1", "закрыть@2"],
            ["Текстовая трансляция TTS@0", "Текстовая трансляция в формате PCM@1"],
            ["контроль@1", "нет контроля@0"],
            ["Выход 1@1", "Выход 2@2", "Выход 3@3"],
            ["Канал 1@1", "Канал 2@2", "Канал 3@3", "Канал 4@4",
                 "Канал 5@5", "Канал 6@6", "Канал 7@7", "Канал 8@8"],
            ["ADAS@1", "DSM@2", "BSD@3"],
            ["генерировать@1", "не генерировать@0"],
            ["объединить@1", "Не объединять"]
        ],
        special_localhost_AI_settings_titleArr : [
            "Включить", "Голос тревоги", "Включить", "Интервал(ы) оповещения о тревоге",
             "Тип голоса", "Голосовой контент", "Аксессуары этого канала", "Документ о состоянии автомобиля (формат bin)",
             "Длительность видео", "Время захвата до точек видеосигнала тревоги", "Время захвата после точек видеосигнала тревоги",
             "Аксессуары канала расширения", "Расширить канал изображения", "Увеличить количество изображений", "Канал расширения видео", "Управление выходом тревоги",
             "Управление тревожным выходом", "Время управления тревожным выходом"
        ],
        special_localhost_AI_settings_tips: [
            "Интервал голосовой трансляции >= 20", "Длительность видео <= 120"
            ,"Увеличить количество фотографий <= 10"
        ],

        // 本地策略 默认设置
        default_settings_title: ["корпус"],

        localhost_ai_change_title: ["Точный путь к файлу", "Введите текст трансляции"],

        localhost_ai_input_msg: ["Подсказка продолжительности видео не может <= 0"],

        // 本地策略-下拉选择器事件
        localhost_ai_arr: [
            // DSM1
            [1,
                [
                    "Усталость@" + 0x01, "Закрытие глаз@" + 0xFE, "Разговор по телефону@" + 0x02,
                    "Курение@" + 0x03, "Отвлечение@" + 0x04, "Ненормальное состояние водителя@" + 0x05,
                    "Закрытие камеры@" + 0x07, "Фиксация DSM тревоги@" + 0x10, "Смена водителя@" + 0x11,
                    "Фиксация IC события@" + 0x12, "Уведомление о событии@" + 0x20, "IC-карта заблокирована@" + 0x1F]],
            // DSM2
            [2,
                ["Ремень безопасности@" + 0x0A, "Руки не на руле@" + 0x0C, "Игра в телефон@" + 0x0D]],
            // ADAS
            [0,
                ["Угроза столкновения@" + 0x01, "Тревога опасного сближения@" + 0x02, "Съезд с полосы движения@" + 0x03,
                    "Угроза столкновения с пешеходом@" + 0x04, "Тревога о смене полосы движения сплошной линией@" + 0x05, "Тревога о препятствиях@" + 0x07,
                    "Тревога распознавания знаков@" + 0x10, "Фиксация тревоги ADAS@" + 0x11]],
            // BSD1
            [3,
                ["Тревога слепой зоны@" + 0x03]],
            // BSD2
            [4,
                ["Тревога слепой зоны@" + 0x04]],
        ],
        localhost_ai_option: 'Неверный',

        // languageTL.cmd.two_treeList[10],
        two_treeList : [
            "Другие настройки", "Настройки SMS", "Стратегия видео", "Развертывание видео", "Захват на фиксированном расстоянии", "Захват по времени",
             "Настройка последовательного порта", "Список датчиков температуры", "вход", "выход", "Усталость вождения", "Настройки ИИ", "Тест ИИ",
             "Установить скорость имитации", "Демонстрационный режим", "Имитация выдачи долготы и широты", "Ручная активация тревоги AI", "Основные настройки", "Настройки канала",
             "Настройки DSM", "Идентификация драйвера", "Локальная политика", "Стратегия платформы", "Фильтрация платформы"
        ],
        treeListCms: [
            [
                "Предупреждение о лобовом столкновении", "Предупреждение о выходе из полосы движения", "Предупреждение о слишком близком расстоянии",
                 "Сигнализация при столкновении с пешеходом", "Сигнализация при частой смене полосы движения", "Сигнализация при столкновении с пешеходом",
                 "Событие по распознаванию дорожных знаков", "События по захвату Adas"],
            [
                "Усталость", "Закрытие глаз", "Разговор по телефону",
            "Курение", "Отвлечение", "Ненормальное состояние водителя",
            "Закрытие камеры", "Фиксация DSM тревоги", "Смена водителя",
            "Фиксация IC события", "Уведомление о событии", "IC-карта заблокирована"
            ],
            ["Ремень безопасности", "Руки не на руле","Игра в телефон",
            ],
            ["Тревога слепой зоны"
            ],
            ["Тревога слепой зоны"
            ]
        ],
        platformFn_text: "Платформа",
        child_tree_textArr: [ "Тревога 1-го уровня", "Тревога 2-го уровня", "Тревога 3-го уровня"],

        indexCmd_platfromAlarm: "Получить платформу",
        Capture_title: [
            "Захват по времени", "Захват на фиксированном расстоянии"
        ],
        // languageTL.cmd.new_setCmdData_arr
        new_setCmdData_arr: [
            "выход","Список датчиков температуры","Видео развертывания","Датчик температуры"
             ,"проход","проход","Настройки SMS","Белый список №","номер",
             "Настройки канала", "ввод", "настройка последовательного порта", "управление пользователями"
        ],


        /* ----------------------------------------------------------------------------------------------------------- */

        /* ---------------------------------------------------2022/12/20 update--------------------------------------------------------*/
        clickTab_Poweron_settings: ["Предварительный просмотр каналов"],
        clickTab_serverShutdown_item_title: ["таймер","Дата","Период времени ",
            "Время загрузки","Длительность загрузки"],
        clickTab_serverShutdown_val: ["Понедельник@1", "Вторник@1",
            "Среда@1","Четверг@1", "Пятница@1", "Суббота@1", "Воскресенье@1"],
        clickTab_serverShutdown_item_state: ["Позволить@1","Не дать возможности@0"],

        // 磁盘状态
        special_diskStatusView: [
            "Состояние диска"
        ],
        special_diskStatusView_settingStatus: ["Не заперт@withoulock","Нет@NoDisk"
            ,"Не форматировано@DiskNoformat","Необычные@DiskStateError","Нормально.@DiskNormal"],
        special_diskStatusView_arr: ["Имя памяти","Состояние памяти","Общий объем","Остаточная мощность"],
        special_pc_AI_settings_item: "Предупреждение",
        indexCmd_Al_tips: "Текущее напоминание не настроено ID не найдено",
        now_treeList: ["Поделиться wifi","датчик положительной инверсии"],
        special_timed_snapshot_content: [
            "Ми","Ми","км км","Время","Единицы измерения","Ми","км км",'Б',"Секунда","Расстояние"
        ],

        // 通道设置
        special_passageway_settings_arr: [
            ["Нерыбий глаз@0", "Рыбий глаз@1"],
            ["BSD1@0", "BSD2@1"],
            ["960H@1", "720P@2", "1080P@3", "TVI 720P@4", "TVI 1080P@5", "CVI 720P@6", "CVI 1080P@7", "960P@8"],
            ["Путь вперед@0", "Направо.@1", "Слева.@2", "Задняя дорога@3"]
        ],
        serverOverSpeed_now_title: ["Ночное ограничение скорости","Время начала ограничения скорости"
            ,"Время окончания ограничения скорости"],

        /* -----------------------------------------------------------------------------------------------------------*/


        // 格式化
        serverFormat_settingMode: ["формат",
             "хранилище"
        ],
        serverFormat_settingSelecStreamMain: ["Жесткий диск@1", "SD1@2", "SD2@3", "Аварийное восстановление@4"],

        // 镜像设置
        serverMirror_settingSelecVideo_v: ["Повернуть@1", "Без инверсии@0"],
        serverMirror_settingSelecRote: ["вращать@1", "не вращать@0"],
        serverMirror_settingMode: ["Зеркальная конфигурация", "Коридор", "Отразить по горизонтали", "Отразить по вертикали", "Поворот"],
        serverMirror_arr: ["Коридор", "Горизонт", "Вертикаль"],

        // 超速报警
        serverOverSpeed_settingStatus: ["Включить@1", "закрыть@0"],
        serverOverSpeed_settingModeMaintain: ["Тревога скорости", "Включить", "Зуммер", "Голосовые сообщения", "Выход тревоги", "Скорость предупреждения км", "Время раннего предупреждения", "Скорость тревоги", "Время тревоги"],
        serverOverSpeed_arr: ["s"],

        // 疲劳驾驶
        serverFatigue_settingModeMaintain: ["Усталое вождение", "Включить", "Зуммер", "Голосовые сообщения",
             "Тревожный выход", "Время раннего предупреждения",
             "Время раннего предупреждения", "Время ночного предупреждения",
             "Время ночного будильника", "Длительность ночного будильника"
             ,"Ночное время начала","Ночное время окончания"
        ],
        serverFatigue_settingStatus: ["Включить@1", "закрыть@0"],

        //修改里程
        serverMileset_settingModeMaintain: ["Изменить пробег", "пробег"],

        // 设备重启
        serverReset_settingModeMaintain: ["Перезагрузка устройства"],

        // 拨号
        setPh_settingStatus: ["Включить@1", "закрыть@0"],
        setPh_settingModeMaintain: ["дозвон", "дозвон", "Включить или нет", "Номер телефона", "Точка доступа", "Имя пользователя", "Пароль", "MTU"],

        //蜂鸣器参数
        setBuzzparam_settingModeMaintain: ["Параметры зуммера", "Длительность сигнала", "Длительность отключения звука", "Альтернативная продолжительность", "Интервал цикла", "Количество циклов", "Количество включенных циклов"],
         setBuzzparam_settingStatus: ["Включить@1", "закрыть@0"],

        // 设置速度来源 || 速度源设置
        setSpeedSource_settingStatus: ["GPS@0", "Импульс@1"],
        setSpeedSource_arr: ["Пульсовый коэффициент", "Частота"],

        // предварительное наложение
        previewOverlay_settingMode: ["Предварительный просмотр наложения",
            "Установить элемент"
        ],
       previewOverlay_settingSelecStreamMain: ["Номер автомобиля@1", "Название канала@2", "Дата и время@3",
            "широта и долгота@4", "скорость GPS@5", "сигнализация скорости@6", "сообщение ввода-вывода@7",
            "Статус диска@8", "Усталость за рулем@9", "Короткое замыкание видео@10", "Температура@11", "Время непрерывной езды@12", "Пульсовая скорость автомобиля@13", "Датчик прямого/обратного хода@ 14", "Название сайта@15"],

        // Обратное изображение
        Reversing_image_settingMode: ["Обратное изображение"],
        Reversing_image_settingStatus3: ["Всегда есть @1", "Всегда нет @0"],
        Reversing_image_settingStatus4: ["Включить@1", "Отключить@0"],
        Reversing_image_settingStatus5: ["Включить", "Канал", "Триггерный переключатель", "Видеовыход", "Время ожидания"],
        Reversing_image_settingStatus6 : ["Тридцать секунд.@30","Одна минута.@60","Две минуты.@120","Пять минут.@300"],
        // локальная сеть
        localhost_LAN_settings_settingStreamMain: ["Динамический IP@1", "Статический IP@0"],
        localhost_LAN_settings_settingStreamMain2: ["Динамический DNS@1", "Статический DNS@0"],
        localhost_LAN_settings_arr: ["Тип IP", "IP-адрес",
            "Пример: 192.168.020.254", "Маска подсети", "Пример: 192.168.020.210", "Шлюз по умолчанию",
            "Пример: 255.255.255.000", "Тип DNS", "Адрес DNS", "Пример: 168.095.001.001"],

        // летнее время
        summerTime_settings_settingMode: ["Летнее время"],
        summerTime_settings_settingStreamMain: ["Включить @1", "Отключить @0"],
        summerTime_settings_monthMain: ["Январь@0", "Февраль@1",  "Март@2", "Апрель@3", "Май@4", "Июнь@5", "Июль@6"
            , "Август@7", "Сентябрь@8", "Октябрь@9", "Ноябрь@10", "Декабрь@11"],
        summerTime_settings_arr: ["Включить", "Время начала", "Время окончания"],
        // настройки питания
        PowerSupply_settings_monthMain: ["Авто@2", "12В@0", "24В@1"],
        PowerSupply_defuat_type: ["12B","24B","Авто"],
        PowerSupply_settings_title: "Current voltage: ",
        PowerSupply_settings_title2: "Текущий тип питания",
        PowerSupply_settings_arr: ["Тип питания", "12 В при выключенном напряжении", "12 В при выключенном напряжении", "По умолчанию: 8-11,5 В", "12 В при включенном напряжении", "12 В при включенном напряжении", "По умолчанию: 8,5-12 В", " Напряжение отключения 24 В", "Напряжение отключения 24 В",
            "По умолчанию: 16,0–23,0 В", "Напряжение загрузки 24 В", "Напряжение загрузки 24 В", "По умолчанию: 18,0–24,0 В"],

        // идентификация водителя
        AI_settings_settingStatus: ["Включить @1", "Отключить @0"],
        AI_settings_settingStatus2: ["Распознавание лиц", "Сходство распознавания лиц", "Порог скорости оценки тревоги DSM", "Нормальное лицо", "Распознавание лиц на IC-карте", "Голос распознавания лиц на IC-карте",
            "Функция распознавания лиц ACC Ignition", "Голос распознавания лиц ACC Ignition", "Распознавание лиц с опросом по времени", "Голос распознавания лиц с опросом по времени", "Возврат к распознаванию лиц после выхода из поста", "Возврат после оставления поста Голос распознавания лиц",
            "Интервал опроса по времени", "Секунды"],

        //фильтр платформы
        pc_AI_o_srtttings_settingStreamMain2: ["Тревога ADAS", "Тревога DSM", "Тревога BSD", "Неисправность диска"],

        // Платформа -> ADAS -> Чувствительность
        pc_AI_ADAS_settings_settingStreamMain: ["Вкл.@1", "Выкл.@0"],
        pc_AI_ADAS_settings_settingSelecStreamMain: ["Низкий@0", "Средний@1", "Высокий@2",],
        pc_AI_ADAS_settings_arr: ["Включить", "Скорость срабатывания тревоги ADAS", "Скорость классификации ADAS", "Чувствительность ADAS"],

        // языковые настройки
       la_settingds_settingStatus: ["Упрощенный китайский@0", "Английский@1", "Традиционный китайский@2", "Корейский@3", "Японский@4", "Немецкий@5", "Русский@6", "Французский@ 7",
            "Португальский@8", "Турецкий@9", "Испанский@10", "Итальянский@11", "Польский@12", "Персидский@13", "Тайский@14"
            , "Иврит@15", "Арабский@16", "Индонезийский@17", "Болгарский@18", "Румынский@19", "Греческий@20"
            , "Словацкий@21", "Литовский@22", "Вьетнамский@23", "Чех@24", "Венгерский@25"],
        la_settingds_settingStatus2: ["Язык"],

        // предварительное наложение
        Preview_overlay_settingSelecStreamMain: ["Номер автомобиля@1", "Название канала@2", "Дата и время@3",
            "широта и долгота@4", "скорость GPS@5", "сигнализация скорости@6", "сообщение ввода-вывода@7",
            "Статус диска@8", "Усталость за рулем@9", "Короткое замыкание видео@10", "Температура@11", "Время непрерывной езды@12", "Запись скорости движения@13", "Датчик прямого/обратного хода@ 14"],
	Preview_overlay_settingSelecStreamMain2: ["Проект"],

        // прозрачность меню
        menu_settings_settingSelecStreamMain: ["Низкий@0", "Средний@1", "Высокий@2",],
        menu_settings_settingSelecStreamMain2: ["Прозрачность меню"],

        // видео выход
         video_settings_settingMode: ["Основной дисплей",
            "Разрешение VGA", "CVBS", "Верхнее поле", "Нижнее поле", "Левое поле",
            "Правое поле", "Яркость", "Контрастность", "Оттенок", "Насыщенность",
        ],
        // настройки журнала
       log_settings_settingMode: ["Основной дисплей"],
        log_settings_settingSelecStreamMain: ["Журнал GPS@1", "Журнал 4G@2", "Журнал GPS+4G@3", "Журнал G-Sensor@5"],
        log_settings_settingSelecStreamMain2: ["Включить@1", "Отключить@0"],
        log_settings_arr: ["Включить", "Настройки журнала"],
        // ЖУРНАЛ взаимодействия с платформой
        log_pc_settings_settingMode: ["ЖУРНАЛ взаимодействия с платформой", "Включить",
        ],
        log_pc_settings_settingSelecStreamMain2: ["Включить@1", "Отключить@0"],

        // превью звука
        voice_settings_settingSelecStreamMain: ["Вкл.@1", "Выкл.@0"],
        voice_settings_arr: ["Предварительный просмотр голоса"],

         // предварительный просмотр загрузки
        Poweron_settings_settingSelecStreamMain: [`Один экран@0`, "Четыре экрана 1-4@1",
            "Шесть экранов@2", "Восемь экранов@3", "Девять экранов@4", "Четыре экрана 5-8@5",
            "Разделить два снимка по вертикали@6", "Разделить два снимка по горизонтали@7", "Два снимка вверх и вниз@8", "Четыре снимка по вертикали H@9"
            , "Горизонтальный H, четыре изображения@10", "Пять изображений@11", "Пять изображений (IPC)@12"
            , "Три изображения сычуаньской формы@13", "Три изображения двух верхних и нижних@14", "Двенадцать изображений@15", "Три разделенных шести изображения@16"],
        Poweron_settings_arr: ["Режим"],

        // special_cmd.js

        // исключение диска
        special_Disk_exception_settingMode: ["Исключение диска"],
        special_Disk_exception_settingStatus: ["Начать@1", "Закрыть@0"],
        special_Disk_exception_av_array_len: ["Дисковое исключение@0", "Диск №1"],
        special_Disk_exception_arr: ["Тип", "Включить", "Зуммер", "Тревожный выход"],

      // Запрос информации о канале
        special_passageway_info_settings_settingStatus: ["Да@1", "Нет@0"],
        special_passageway_info_settings_settingStatus2: ["Вкл.@1", "Выкл.@0"],
        special_passageway_info_settings_settingStatus3: ["Широкоугольный@1", "Неширокоугольный@0", "Рыбий глаз@2"],
        special_passageway_info_settings_settingStatus4: ["ADAS@1", "DMS@3", "HOD@3", "BSD@4"],
        special_passageway_info_settings_settingStatus5: ["960P@1", "720P@0", "1080P@2"],
        special_passageway_info_settings_settingStatus6: ["Передняя шторка@1", "Правая задняя шторка@0", "Левая передняя шторка@2"],
        special_passageway_info_settings_settingStatus7: ["N@1", "P@0"],
        special_passageway_info_settings_arr: ["Канал запроса", "Тип ИИ", "Калибровка", "Камера", "Стандарт камеры", "Тип камеры", "Разрешение камеры", "Положение установки камеры", "Канал"],

        // настройки канала
        special_passageway_settings_settingStatus: ["Да@1", "Нет@0"],
        special_passageway_settings_settingStatus2: ["Вкл.@1", "Выкл.@0"],
        special_passageway_settings_settingStatus3: ["Широкоугольный@1", "Неширокоугольный@0", "Рыбий глаз@2"],
        special_passageway_settings_settingStatus4: ["Нет@0", "ADAS@1", "DMS@2", "HOD@3", "BSD1@4", "BSD2@5", "BSD3@6"],
        special_passageway_settings_settingStatus5: ["960@1", "720@0", "1080@2"],
        special_passageway_settings_settingStatus6: ["Передняя шторка@1", "Правая задняя шторка@0", "Левая передняя шторка@2"],
        special_passageway_settings_settingStatus7: ["N@1", "P@0"],
        // special_passageway_settings_arr: ["Номер канала", "Настройки AI", "Положение установки камеры", "Тип камеры", "Разрешение камеры", "Стандарт камеры", "Калибровка"],

        // видео потеряно
        special_VideoLoss_settingMode: ["Потеря видео"],
        special_VideoLoss_settingStatus: ["Да@1", "Нет@0"],
        special_VideoLoss_arr: ["Номер канала", "Включить", "Зуммер", "Тревожный выход", "Видео", "Канал"],

        // Конфигурация хранилища записи основного и дополнительного потока || Хранилище записи
        special_jjjjal_settingMode: ["Конфигурация хранилища записи основного и дополнительного потоков",
            "Тип", "Циклическая коррекция", "HDD", "HDD2", "SD", "SD2", "Аварийное восстановление"
        ],
        special_jjjjal_settingStreamMain: ["Циклическое покрытие @1", "Не перезаписывать @0"],
        special_jjjjal_settingStreamMain2: ["Основной поток@1", "Доп.поток@0"],
        special_jjjjal_arr: ["Основной поток", "Доп.поток"],
	
        // 夏令时
         special_coulomn_select_add_monthMain: [
            ["Январь", 0], ["Февраль", 1], ["Март", 2], ["Апрель", 3]
            , ["май", 4], ["июнь", 5], ["июль", 6], ["август", 7]
            , ["Сентябрь", 8], ["Октябрь", 9], ["Ноябрь", 10], ["Декабрь", 11]
        ],
        special_coulomn_select_add_numMain: [
            ["первый", 0], ["второй", 1], ["третий", 2]
            , ["четвертый", 3], ["последний", 4]
        ],
        special_coulomn_select_add_weekMain: [
            ["воскресенье", 0], ["понедельник", 1], ["вторник", 2], ["среда", 3], ["четверг", 4], ["пятница", 5], [ " Суббота", 6]
        ],

        // глобальная сеть
        special_localhost_WAN_settings_arr: ["Маска подсети", "Пример: 255.255.255.0", "Шлюз по умолчанию", "Пример: 192.168.141.1",
            "DNS-адрес", "Пример: 114.114.114.114"],
        // наложение видео
        special_localhost_videoOverlay_settings_settingMode: ["Наложение видео"],
        special_localhost_videoOverlay_settings_settingSelecStreamMain: ["Номер автомобиля@3", "Название канала@4",
            "Скорость GPS@5", "широта и долгота@6", "время@7", "привычки вождения@8", "непрерывное время вождения@9",
            "рекордная скорость вождения@10", "название станции@11","SN@12" ],
        special_localhost_videoOverlay_settings_arr: ["Канал", "Имя канала", "Оверлей"],
        // настройки изображения
        special_Image_settings_settingMode: ["Настройки изображения"],
        special_Image_settings_settingStatus: ["Пользовательский", "Стандартный", "Холодный", "Теплый"],
        special_Image_settings_arr: ["AV", "Качество", "Яркость", "Контрастность", "Оттенок", "Насыщенность"],

        // кнопка набора номера
        setPh_settings_arr: ["Операция", "Восстановление до заводских", "Настройки по умолчанию"],
        // Отправляем и получаем оперативную информацию
        layMeg_arr: ['Устройство ответило и загрузилось на страницу', 'Устройство не вернуло корректные данные'
            , 'Нажмите, чтобы выбрать автомобиль', 'Выдана команда запроса, ожидание ответа устройства', 'Выполняется команда', 'Выполняется формирование команды', 'Команда должна быть сформирована' , "Команда отдана", "Команда отправлена, ожидание ответа устройства"],


        // пользовательский контент
        create_common_cmd_arr: ["Тип", "Выберите форму команды для отправки на устройство", "Нажмите для завершения задачи отправки команды, а после отправки команды проверьте, получила ли устройство команду", "Введите команду, которую необходимо отправить. заказ, а затем нажмите кнопку слева, чтобы оформить заказ"],
        trTitle_str: "Руководство",
        setSvr_settingModeMaintain: ["Адрес сервера", "Порт управления сервером", "Порт данных сервера"],
        // активация карты
     
        setMap_settingStatus: ["Вкл@1", "Выкл@0"],
        setMap_arr: ["Статус переключения"],
        // Отправляем скорость симуляции GPS
        setSpeedGPS_arr: ["значение скорости"],
        // очистить зуммер
        setClearBuzzparam_settingStatus: ["Включить@1", "Отключить@0"],
        setClearBuzzparam_arr: ["Очистить зуммер"],

        setSimUnLock_settingStatus: ["Разблокировать@1", "Разблокировать@0"],
        setSimUnLock_settingModeMaintain: ["Блокировка и отвязка SIM-карты", "Отвязать ли"],
        setSimLock_settingModeMaintain: ["Номер из белого списка блокировки SIM-карты", "", "белый список 1", "белый список 2", "белый список 3"],
        setVoice_settingStatus: ["Динамик AVout для интеркома@0", "Динамик TTS для интеркома@1"],
        setVoice_settingModeMaintain: ["Настройка выхода динамика внутренней связи", "Выход динамика внутренней связи"],
        setIcCardTime_settingModeMaintain: ["Время обнаружения IC-карты"],
        setIcCard_settingStatus: ["Включить@1", "Отключить@0"],
        setIcCard_settingModeMaintain: ["Подсказка о том, что IC-карта не вставлена", "Голосовая подсказка", "Зуммер"],

        setSpeed_settingStatus: ["Включить@1", "Отключить@0"],
        setSpeed_settingModeMaintain: ["Режим превышения скорости", "Включить переключатель"],
        setMac_settingModeMaintain: ["MAC-адрес", "MAC-адрес"],
        serverOuth_settingModeMaintain: ["Адрес сервера управления авторизацией", "Порт сервера управления авторизацией"],

        serverLog_settingModeMaintain: ["ЖУРНАЛ загрузки FTP", "FTP-адрес", "FTP-порт", "имя пользователя", "пароль", "путь загрузки (относительный путь)"],

        serverWakeup_settingStatus: ["Текстовое пробуждение@$WAKEUP", "SMS wakeup@WAKEUP"],
        serverWakeup_settingModeMaintain: ["Пробуждение из спящего режима", "Режим пробуждения", "Время пробуждения"],
        // ограниченный ночной режим
        serverNightTime_settingStatus: ["Включить@1", "Отключить@0"],
        serverNightTime_settingModeMaintain: ["Ночной режим ограничения времени", "включить переключатель", "часы начала", "минуты начала", "секунды начала", "часы окончания", "минуты окончания", "секунды окончания" ],
        
        // режим ночного ограничения скорости
        serverNightSpeed_settingStatus: ["Включить@1", "Отключить@0"],
        serverNightSpeed_settingModeMaintain: ["Режим ограничения ночной скорости", "Включить переключатель", "Час начального времени", "Минута начального времени",
            "время начала секунд", "время окончания часов", "время окончания минут", "время окончания секунд"],

        serverMaintain_settingMaintainStatus: ["Включить@1", "Отключить@0"],
        serverMaintain_settingSelectMaintainDate: ["Каждый день@0", "Воскресенье@1", "Понедельник@2", "Вторник@3", "Среда@4",
            "Четверг@5", "Пятница@6", "Суббота@7"],
        serverMaintain_settingModeMaintain: ["Запланированный перезапуск", "Запланированный перезапуск", "Частота запланированного перезапуска", "Запланированное время перезапуска в день"],

        serverShutdown_settingShutdown: ["Настройка задержки выключения",
            "Задержка выключения", "Длительность задержки", "Включить спящий режим", "Частота отчета о местоположении", "Код региона", "Номер производителя", "Номер кадра VIN", "Классификация номерного знака", "Номер двигателя"
        ],
        serverShutdown_settingSelectShutdown: ["Отложенное выключение@1", "Без выключения@0"],
        serverShutdown_settingSelectShutdown1: [
            // "Спящий режим@0", "Включить спящий режим@1",
            "Включить @1",
            "Не включать @0"
        ],
        //настройки сервера
        serverSettings_settingServerStatus: ["Включить@1", "Отключить@0"],
        serverSettings_settingTlServer: ["Главный сервер 1@$JTSVR", "Главный сервер 2@$JTSVR2", "Главный сервер 3@$JTSVR3",
            "Главный сервер 4@$JTSVR4", "Главный сервер 5@$JTSVR5"],
        serverSettings_setting1: ["Настройки сервера", "Адрес сервера", "Порт сервера", "Включить сервер", "Автопереключение"],

        serverGPS_setting2: ["Настройки отчетов GPS"],
        serverGPS_setting1Filter: ["секунд (по умолчанию 15)", "секунд (по умолчанию 120)", "секунд (по умолчанию 15)", "секунд (по умолчанию 15)"],
        serverGPS_settingServerStatus: ["Включить@1", "Отключить@0"],
        serverGPS_setting1: ["Нормальный интервал загрузки", "Интервал загрузки в спящем режиме", "Водитель не вошел в систему в интервале загрузки", "Интервал загрузки аварийного сигнала тревоги"],



        // indexCmd.html
        DistributionText: "Отправить команду",
        DistributionStatistics: "История сообщений",
        setData_arr: ["Канал", "Включить"],
        // основное направление
        setManData_setting2: ["Настройка основного потока", "Настройка дополнительного потока"],
        setManData_setting1Filter: ["", "секунд (по умолчанию 120)", "секунд (по умолчанию 15)", "секунд (по умолчанию 15)"],
        setManData_settingServerStatus3: ["Плохо@0", "Плохо@1", "Средне@2", "Хорошо@3", "Очень хорошо@4", "Лучше@5"],
        setManData_fontArr: ["Канал", "Частота кадров", "Постоянный битрейт@0", "Тип битрейта", "Битрейт", "Качество изображения", "Стандарт кодирования", "Переменный битрейт@1"],

        setCmdData_settingSelecVideo_v: ["Не переворачивать @0", "Переворачивать @1"],
        setCmdData_settingSelecRote: ["Не поворачивать@0", "Поворачивать@1"],
        setCmdData_settingMode: ["Настройка зеркала", "Канал", "Горизонтальное отражение", "Вертикальное отражение", "Вращение"],
        setCmdData_fontArr: ["Канал", "Горизонтальный", "Вертикальный"],
        setCmdData_table: ["Список WIFI"],
        setCmdData_$WIFILIST_fontArr: ["включено", "неавторизовано", "тип модуля", "нет модуля", "серийный номер", "ESSID", "статус"],
        // ----------------------------------- 2023/03/07 -----------------------------------------
        setCmdData_$WIFILIST_role: ["Проверено....", "Разрешено", "Не санкционирована"],
        setCmdData_$WIFILIST_module: ["Проверено.", "Нет модулей", "2.4G"],
        // ----------------------------------- 2023/03/07 -----------------------------------------
        setCmdData_$WIFILIST_workState: ["--", "Запретить", "Подключено","Не подключен"],

        // ----------------------------------- 2023/04/10 -----------------------------------------
        setCmdData_$SCREENMODE_poll: ["Нет","5s","10s","20s","30s","1min","2min","5min"],
        setCmdData_$SCREENMODE_font: "Предварительный просмотр опроса",
        // ----------------------------------- 2023/04/10 -----------------------------------------
        setCmdData_$IMAGE_fontArr: ["Настройки изображения"],

        setListSelect_fontArr: ["Канал"],

        setDate_fontArr: ["Ожидание принятия устройства", "Сбой", "Неизвестная информация", "Информация об ошибке"],
        settingUpdate_402_fontArr: ["Список WIFI"],
        settingUpdate_403_fontArr: ["Восстановить до заводских", "Восстановить до заводских", "Общая информация", "Информация об автомобиле", "Вся информация"],
        setWifiData_fontArr: ["Установить IP", "Включить", "ESSID", "Пароль", "Динамический", "Статический", "IP", "Маска подсети", "Шлюз по умолчанию",
            "Динамический DNS", "Статический DNS", "DNS-сервер", "Поиск"],
        getWifiList_fontArr: ["включить", "не авторизовано", "тип модуля", "нет модуля", "серийный номер", "ESSID", "статус", "настройка WIFI"],
        WifiSearch_fontArr: ["Результаты поиска", "Нужен ли пароль", "Уровень сигнала"],


        // tree.js
        tlcmds_fontArr: [
            "Доставка команды Tongli", "Доставка текста", "Общие настройки", "Основные настройки", "Языковые настройки", "Информация о транспортном средстве", "Настройки вывода видео", "Предварительный просмотр при включении", "Предварительный просмотр наложения", " Предварительный просмотр звука",
            "Прозрачность меню", "Видео выход", "Настройка времени", "Настройка системного времени", "Летнее время", "Настройка включения/выключения питания", "Настройка питания", "Перезапуск таймера", "Включение/выключение питания", "Настройки GPS", "Настройки отчетов GPS",
            "настройка пробега", "настройка источника скорости", "обслуживание оборудования", "перезагрузка", "формат диска", "настройка ЖУРНАЛА", "ЖУРНАЛ взаимодействия с платформой", "восстановление параметров", "настройка сети", "3G/4G настройки дозвона", "Дозвон",
            "Настройка проводной сети", "LAN", "WAN", "Настройка WIFI", "Настройка записи", "Настройка звука", "Настройка режима", "Настройка изображения", "Настройка зеркала", "Наложение видео", " Основной поток", "Доп.Поток", "Настройки хранилища",
            "Хранение видео", "Настройки периферийных устройств", "Обратное изображение", "Настройки тревоги", "Потеря видео", "Неисправность диска", "Тревога о превышении скорости", "Статус диска", "Статус камеры", "Статус IPC"
        ],

        diskStatus:"статус диска",
        diskStatusTitle:["Имя памяти","Состояние памяти","Общая емкость","Оставшаяся емкость"],
        cameraStatus: "Статус камеры",
        cameraStatusTitle:"Камера",
        ipcStatusTitle:"IPC",
        cameraStatusDesc:["Не включено","ненормально","не записывает","нормально"]
    }
    , timeStr: "Время(ч)"
    , speedStr: "Скорость (км/ч)"
    , devices: {
        bEnableWakeUpMcuStr: "Будить",
        wakeUpTimeStr: "Время пробуждения (ч)",
        speedLimitStr: "Скорость (км/ч)",
        deadLineStrStr: "Крайний срок",
    }
    , ftpServerinfo: {
        title:[
            "Управление FTP-сервером",
            "Спроси",
            "Настроить",
            "Статус активации домена",
            "Доменное имя",
            "Включить",
            "Не включено"
            ,"IP"
            ,"Порт"
        ],
        colsList: [
            "Статус подключения"
        ],
        enableDomain: [
            "Начальное состояние",
            "Соединение установлено",
            "Регистрация не удалась, отклонена",
            "Вы успешно зарегистрировались"
        ],
        message: "Проверьте хотя бы одно транспортное средство для отправки"
    }
    , person: {
        table_title: ["ID устройства", "Гос.Номер", "Компания", "Организация", "Канал", "Тип протокола", "Модель устройства", "Версия прошивки", "Время создания", "Время первого подключения к сети" , "Время последнего подключения", "SN"]
        , table_title_1: ["Пользователь", "Компания", "Время создания", "Происхождение", "Кем создано", "Статус"]
        , tabs: ["Структура компании", "Управление компанией"]
        , action: ["Добавить компанию", "Добавить группу", "Изменить", "Удалить", "Запрос", "ID", "Гос.Номер", "Группа", "Компания", "Добавить пользователя", " Удалить", "Запрос", "Логин", "Компания"]
        , carTitle: "Управление ТС"
        , add: "Добавить"
        , ed: "Редактировать"
        , deleteAll: "Удалить все"
        , delete: "Удалить"
        , move: "Переместить"
        , exportIn: "Импорт"
        , exportOut: "Экспорт"
        , carMove: "Назначить машину"
        , password: "Сбросить пароль"
        , carStatus: "Автомобиль не назначен"
        , carStatus_: "Автомобиль назначен"
        , action_: "Действие"
        , actionAuth: "Авторизация"
        , actionAuth_: "<< Отменить"
        , selectRow: "Выберите запись"
        , addCompany: "Добавить компанию"
        , Company_title: "Невозможно создать новую компанию под флотом"
        , Company_title1: "Добавить группу"
        , Company_title2: "Выберите компанию или группу"
        , Company_title3: "Команда временно не поддерживает модификацию"
        , Company_title4: "Выберите компанию или группу"
        , Company_title5: "Выберите компанию или группу"
        , Company_title6: "Добавить устройство"
        , Company_title7: 'Изменить оборудование'
        , Company_title8: "Изменить лицензированные устройства"
        , Company_title9: "В настоящее время ни одна компания не поддерживается флотом"
    }
    , setPass: {
        base: "Основная информация"
        , passold: "Исходный пароль"
        , pass: "Новый пароль"
        , pass_: "Подтвердить пароль"
        , submit: "Отправить"
        , reset: "Сброс"
    }
    , export: {
        file: "Файл"
        , result: "Результат"
        , dom: "Скачать шаблон"
    }
    , personAdd: {
        companyName: "Компания"
        , companyMaxDeviceNum: "Количество авторизаций"
        , administratorUser: "Логин"
        , administratorPassword: "Пароль"
        , userName: "Логин "
        , pass: "Пароль"
        , userAuth: "Авторизация пользователя"
        , userStatus: "Статус"
        , userAuthArray: ["Администратор", "Пользователь", "Демо"]
        , userStatusArray: ["Включен", "Отключен"]
        , authMan: "Права доступа"
        , authToast: "Выберите хотя бы одно разрешение?"
        , passwordNull: "Пароль не может быть пустым"
        , passwordMin: "Сложность вашего пароля слишком мала (пароль должен содержать буквы, цифры, 5-30 цифр), своевременно меняйте пароль!"
    }
    , addDevice: {
        deviceId: "ID устройства"
        , deviceName: "Гос.Номер"
        , maxChn: "Количество каналов"
        , parentName: "Организация"
        , type: "Тип протокола"
    }
	, lockStr: {
        service: ["Полная блокировка", "Полное решение"],
        serviceConfig: ["Отключить", "Включить"],
        carDeviceStr: ["Заблокировано", "Разблокировано"],
        statusSIM:"Статус SIM",
    },
    ftpServer: {
         ftpTittle: "Список FTP",
         tabsTitle: ["время", "файл", "размер", "время создания", "путь", "количество файлов", "каталог файлов"],
         ftpReturn: "Верхний уровень"
         ,ftpDelete: "Удалить выбранную запись?"
         ,GetDeviceTimerUploadConfigResponseCols:["Тип", "Поток", "Настройки файла", "Период времени видео", "Период времени загрузки", "Время срабатывания будильника (сек)", "Канал", "Название правила", "Операторы "]
         ,ftpDeleteTitle: "Удалить политику"
         ,getFtpStr:"Запрос"
         ,ftpDeleteTitleDialog: "Удалить<span  style='font-size:30px;font-weight:600;color: red;'>@</span>политику автомобиля?"
         ,pathFile:"Каталог"
         ,pathHome:"Путь"
         ,typeRadioStr:["Изображение","Видео"]
         ,manStr:"Управление FTP"
         ,autoDelete:"Автоматически удалять файлы"
         ,turnOn:["Вкл","Выкл"]
         ,delteStr:"Удалить"
         ,detelStrPlor: "Удалить данные за последние несколько дней"
         ,ftpSelect:"Пожалуйста, выберите транспортное средство"
         ,dayTitle: "день"
         ,typeStr:"Type"
     },

    // сообщаем статистику
    count: {
        choice: 'выбор',
        timeFrame: 'таймфрейм',
        months: 'месяц',
        weeks: "Период",
        startTime: 'Время начала',
        endTime: 'Время окончания',
        query: 'запрос',
        reset: "сброс",
        year: 'год',
        countTab:["Управление безопасностью", "Онлайн оффлайн", "GPS статистика"],
        btns: ['Добавить', 'Изменить', 'Удалить', 'Отправить', 'Добавить конфигурацию', 'Изменить конфигурацию', 'Выберите хотя бы один элемент данных', 'Выберите элемент данных', "Удалить не удалось", "Добавить не удалось", "Добавить успешно", "Текущая загрузка", "Все загрузки", "Время отображения", "Ошибка формата времени"],
        btns2: ['Статистика по каждому конкретному типу тревоги', 'Просмотр', 'Всего', 'Статьи', 'Не в формате видео и изображения и не может быть отображено!', 'Ошибка загрузки данных!', 'Нет вложений'] ,
        meunData: ['Статистика онлайн и офлайн', 'Статистика сигналов тревоги', 'Управление активной безопасностью', 'Расширенная помощь водителю (ADAS)', 'Мониторинг водителя (DSM)', 'Обнаружение слепых зон (BSD)', 'Интенсивное вождение Поведение (SDA)', "Конфигурация политики загрузки вложений", "Политика управления дисками"],
        onlineData: ['ID устройства', 'Гос.Номер', 'Название компании', 'время в сети', 'время в автономном режиме', 'продолжительность в сети', 'продолжительность в автономном режиме', 'список информации о тревогах', 'код тревоги', ' Количество тревог'],
        safeData: ['онлайн-информация', 'автономная информация', 'IP-адрес', 'общее количество тревог', 'тип тревоги/количество тревог', 'тип тревоги', 'уровень тревоги', 'уровень усталости', ' скорость автомобиля', "широта", "долгота", "время начала", "адрес"],
        alarmData: ['Информация о вложении (уже/всего)', 'Номер вложения', 'Адрес файла вложения', 'Скорость впереди идущего автомобиля', 'Расстояние до впереди идущего автомобиля', 'Тип отклонения', "Дорожный знак тип распознавания", "Данные распознавания дорожных знаков", "Информация о состоянии автомобиля"],
        AttachmentUpload: ['Список политик загрузки вложений ADAS', 'Список политик загрузки вложений DSM', 'Список политик загрузки вложений BSD', 'Список политик загрузки вложений SDA', 'ADAS', 'DSM', 'BSD', 'SDA' ],
        ADAS: ['Предупреждение о лобовом столкновении', 'Предупреждение о выходе из полосы движения', 'Предупреждение о расстоянии до автомобиля', 'Предупреждение о столкновении с пешеходом', 'Предупреждение о частой смене полосы движения', 'Предупреждение о выезде за пределы дорожного знака', 'Предупреждение о препятствии', 'Сигнализация опрокидывания при столкновении ', 'событие распознавания дорожного знака', 'событие активного захвата'],
        BSD: ['Тревога приближения сзади', 'Тревога приближения слева сзади', 'Тревога приближения справа сзади'],
        SDA: ['Предупреждение о резком ускорении', 'Предупреждение о резком торможении', 'Предупреждение о резком повороте', 'Предупреждение о холостом ходу', 'Предупреждение о ненормальном перегорании', 'Предупреждение о движении по инерции', 'Предупреждение о перегрузке двигателя'],
        DSM: ['Сигнализация усталости вождения', 'Сигнал вызова', 'Сигнал курения', 'Сигнализация отвлеченного вождения', 'Сигнализация водителя', 'Событие автоматического захвата', 'Событие смены водителя'],
        normal: ['Сигнализация об отключении основного питания терминала', 'Сигнализация о низком напряжении главного источника питания терминала', 'Аварийная тревога.',
            'Уведомление о потере видео', 'Отказ жесткого диска', 'Сбой SD1', 'Сбой SD2', 'неисправность аварийного щита', 'Отключение антенны GNSS', 'Короткое замыкание антенны GNSS',
            'Отказ модуля GNSS', 'Предупреждение о превышении скорости', 'Сигнал тревоги.', 'Предупреждение об усталости вождения.', 'Усталость вождения сигнализация'],
        IO: ['Сигнализация IO1', 'Сигнализация IO2', 'Сигнализация IO3', 'Сигнализация IO4', 'Сигнализация IO5', 'Сигнализация IO6', 'Сигнализация IO7', 'Сигнализация IO8'],
        realTime: ['Обычное напоминание', 'ИО тревога', 'Вызов тревоги', 'Тревога', 'Обработка описаний', 'Обработка', 'Отменить', 'Успешно обработано',
            'Ошибка обработки', 'Номер машины.', 'Уровень напоминания', 'Отчет напоминания'],
        otherAlarm: ['Предупреждение о неисправности ячейки памяти', 'Сигнализация SDA', 'Сигнализация о неисправности камеры / помощи водителю', 'Камера отключает сигнализацию.',
            'Сигнал тревоги, оторвавшийся от руля.', 'Полиция без маски.', 'Вода в полицию', 'Сигнализация с закрытыми глазами'],
        level: ['Уровень 1', 'Уровень 2', 'Статистика обычных напоминаний', 'Статистика оповещения', 'Подробная таблица обычного напоминания', 'Подробная форма напоминания',
            'Общее количество обычных напоминаний', 'Общее количество предупреждений', 'Сигнализация в реальном времени', 'Поиск номерных знаков.'],
        error: ['Внутренняя ошибка сервера', 'Ошибка тайм - аута', 'Пользователь не зарегистрирован', 'Параметры пусты', 'Пользователь не выполнил запрос UserIn', 'Пользователь не зарегистрирован'],
        // level: ['Тревога', 'Тревога'],
        VehicleState: ['ACC: вкл.', 'Левое рулевое управление: вкл.', 'Правое рулевое управление: вкл.', 'Очиститель: вкл.', 'Тормоз: вкл.', 'Устройство: карта', 'Местоположение: вкл.'],
        special: ['Отклонение влево', 'Отклонение вправо', 'Знак ограничения скорости', 'Знак ограничения высоты', 'Знак ограничения веса'],
        extal: ['Таблица статистики ADAS', 'Таблица статистики BSD', 'Таблица статистики DSM', 'Таблица статистики SDA', 'Таблица сведений ADAS', 'Таблица сведений BSD', 'Таблица сведений DSM', 'Таблица сведений SDA', 'Нет данных', 'Статистика устройства онлайн и офлайн', 'Сведения об устройстве онлайн и офлайн'],
        tableData: ['Общее количество вложений', 'Общее количество загружаемых вложений', 'Общее количество загруженных вложений', 'Общее количество файлов изображений', 'Общее количество видеофайлов', 'Общее количество других файлов', "Статистика каждого конкретного типа тревоги", "Общее количество тревог ADAS", "Общее количество тревог BSD", "Общее количество тревог DSM", "Общее количество тревог SDA", "Информация о вложениях (загружено/выгружается/общее количество )"],
        disk: ['Установить политику управления', 'Правило очистки диска', 'Минимальное свободное пространство на диске (МБ)', 'Максимальное время хранения файла (дней)', 'Управление диском', 'Папка (используется)', 'Диск Свободное место', "Занятое место на диске", "Текст", "Видео", "Изображение", "Аудио", "Другое"],
        disk1: ['диск', 'общее пространство на диске', 'размер папки', 'количество файлов', 'неуказанная очистка диска', 'приоритет времени создания', 'приоритет размера файла', 'неуказанное управление диском', "файл Политика истечения срока действия", "Политика бесплатного пространства"]

    }
    ,
    gpsCount:{
        tabs:["ID","Гос.Номер","Компания","Пробег(км)","Дата", 'Конец не может быть раньше начала.', 'Начало не может быть после окончания.']
    }
    // состояние записи устройства
    , deviceVideo: {
        disk: ['статус диска', 'жесткий диск', 'диск1', 'диск2', 'емкость', 'статус загрузки', 'статус раздела', 'индекс раздела', 'статус DBR', 'статус FAT', 'Информация индекса записи'],
        info: ['Состояние записи устройства', 'Восстановление', 'Системная частота кадров', 'Фактическая частота кадров', 'Временная метка I-кадра', 'Номер P-кадра', 'Пакетное получение текущего состояния диска устройства', 'Получить', "Пожалуйста, контролируйте его в течение часа!", 'Прерывистая запись и время пропуска кадров'],
        video: ['информация о записи', 'информация о частоте кадров', 'информация о группе изображений', 'канал', 'нормальный', 'аномальный', 'непоследовательный', 'сначала проверьте автомобиль! ', 'Восстановление успешно', 'Восстановление не удалось', 'Пожалуйста, выберите раздел', 'Пожалуйста, выберите автомобиль'],
        dowmload: ['Загрузка файла', 'Выбрать все', 'Пакетный экспорт потерянных данных видео', 'журнал флэш-памяти', 'тип события', 'ошибка содержимого таблицы FAT', 'запись каталога не соответствует FAT', 'Количество кластеров, занятых каталогом, ненормально', "Системная ошибка"],
        error: ["Имя Группы", "Статистический тип", "Всего", "Статистический тип", "Общее оборудование", "Устройство не отвечает", "Отчеты по оборудованию", "Журнал флэш-памяти", "Потеря", "Не потеряно", " Потеря выравнивания", "Выравнивание не потеряно", "Нет загрузки"],
        loss: ["Компания", "Модель", "Самопроверка видео", "В таблице нет данных, сначала запросите", "Статус MBR", "Количество заявленных устройств"],
        type: ["Нормальный итог", "Общее количество исключений", "Общее количество исключений монтирования", "MBR", "DBR", "FAT", "индекс"],
        tongdao: ['Канал 1', 'Канал 2', 'Канал 3', 'Канал 4', 'Канал 5', 'Канал 6', 'Канал 7', 'Канал 8'],
        diuzhen: ['тип потери', 'разблокировано', 'нет диска', 'аномальный перезапуск', 'другое', 'общее количество кадров', 'количество I-кадров', 'время события', 'время загрузки устройства', ' неизвестный'],
        info2: ['получить пакетную информацию о частоте кадров диска', 'самопроверка пакетной записи', 'промежуток времени извлечения', 'статус потери записи на стороне устройства', 'кадр потери записи на носителе на стороне устройства', 'кадр потери записи ', 'время запроса', 'контент запроса', 'время возврата', 'контент возврата'],
        file: ["Потеря видео", "Потеря видео", "Видео не потеряно", "Устройство не отвечает", "Статистика потери видео", "Статистика состояния диска"],
        log: ['загрузка', 'выключение', 'аномальный перезапуск потока', 'аномальная запись', 'сбой питания', 'отключение из-за низкого напряжения', 'найден жесткий диск', 'найдена SD-карта', 'найден расширенный носитель данных ' , 'Ошибка чтения и записи жесткого диска',
        'Ошибка чтения/записи SD-карты', 'Ошибки чтения и записи расширенных носителей', 'Жесткий диск не обнаружен, перезагрузите устройство', 'SD-карта не обнаружена, перезагрузите устройство', 'Не обнаружена перезагрузка для расширенного носителя данных', 'Слишком много ошибок жесткого диска перезагрузки', 'Слишком много ошибок SD перезагрузки',
        'Ошибка внешнего носителя данных. Слишком много перезагрузок.', 'Перезагрузите жесткий диск', 'Перезагрузить SD-карту', 'перезагрузить внешнее хранилище 20', 'Не удалось перезагрузить HDD', 'Ошибка перезагрузки SD-карты.', 'Не удалось перезагрузить расширенный носитель',
        'Слишком много жестких дисков сбрасывается и перезагружается', 'Сброс SD-карты слишком много перезагрузок', 'Сброс расширенного носителя данных слишком много перезагрузок', 'Жесткий диск успешно перезагружен', 'SD-карта успешно перезагружена', 'Успешно перезагрузил носитель',
        'жесткий диск потерян', 'потерянная SD-карта', 'Расширенный носитель данных потерян', 'Ремонт области конфигурации', 'SD-карта 2 найдена', 'SD-карта 2 отсутствует', 'SD карта 2 ошибка чтения/записи', 'перезагрузить SD-карту 2', 'Ошибка SD2 слишком много перезагрузок',
        'Перезагрузка SD-карты 2 успешно', 'перезагрузить SD-карту 2 не удалось', 'SD-карта 2 сбрасывает слишком много перезагрузок', 'SD-карта не обнаружена 2 перезагрузка', 'Обновление авторизации загрузки', 'Импорт параметров загрузки', 'Обновление загрузки микроконтроллера',
        'Обновление материнской платы загрузки', 'Начинается удаленное обновление материнской платы', 'Удаленное обновление микроконтроллера', 'Загрузка по расписанию', 'удаленный пробуждение', 'форматирование жесткого диска', 'отформатировать SD-карту', 'Отформатируйте SD-карту 2', 'Форматировать расширенный раздел',
        'Не удалось отформатировать жесткий диск', 'Не удалось удалить SD1', 'Не удалось удалить SD2', 'Не удалось размонтировать расширенный раздел', 'Отформатировать раздел жесткого диска', 'Отформатируйте раздел SD-карты 1', 'Отформатируйте SD-карту 2 раздела', '格式化扩展分区Форматировать расширенный раздел',
        'HDD без узлов', 'SD1 нет узла', 'SD2 нет узла', 'Расширенный раздел без узлов', 'Восстановление жесткого диска MBR', 'SD1 Восстановить MBR', 'SD2 ремонт MBR', 'Расширенное восстановление раздела MBR', 'АСС выключен',
        'Размонтировать раздел жесткого диска 1 не удалось', 'Размонтировать раздел жесткого диска 2 не удалось', 'Размонтировать раздел жесткого диска 3 не удалось', 'Размонтировать раздел жесткого диска 4 не удалось', 'Не удалось размонтировать SD1, раздел 1.', 'Не удалось размонтировать SD1, раздел 2.', 'Размонтировать SD1 раздел 3 не удалось', 'Размонтировать раздел SD1 4 не удалось',
        'Размонтировать раздел SD2 1 не удалось', 'Не удалось размонтировать раздел 2 SD2', 'Размонтировать SD2 раздел 3 не удалось', 'Размонтировать раздел SD2 4 не удалось', 'Не удалось размонтировать расширенный раздел 1', 'Не удалось размонтировать расширенный раздел 2', 'Не удалось размонтировать расширенный раздел 3',
        'Не удалось размонтировать расширенный раздел 4', 'Отформатируйте раздел жесткого диска 1', 'Отформатируйте раздел жесткого диска 2', 'Отформатируйте раздел жесткого диска 3', 'Отформатируйте раздел жесткого диска 4', 'формат SD1 раздел 1', 'отформатировать SD1 раздел 2', 'формат SD1 раздел 3',
        'формат SD1 раздел 4', 'формат SD2 раздел 1', 'формат SD2 раздел 2', 'формат SD2 раздел 3', 'формат SD2 раздел 4', 'отформатировать расширенный раздел 1', 'отформатировать расширенный раздел 2', 'отформатировать расширенный раздел 3',
        'отформатировать расширенный раздел 4', 'Не удалось отформатировать раздел жесткого диска 1', 'Не удалось отформатировать раздел жесткого диска 2', 'Не удалось отформатировать раздел жесткого диска 3', 'Не удалось отформатировать раздел жесткого диска 4', 'Не удалось отформатировать SD1 раздел 1', 'Не удалось отформатировать SD1 раздел 2',
        'Не удалось отформатировать SD1 раздел 3', 'Не удалось отформатировать SD1 раздел 4', 'Не удалось отформатировать раздел SD2 1', 'Не удалось отформатировать SD2 раздел 2', 'Не удалось отформатировать SD2 раздел 3', 'Не удалось отформатировать раздел SD2 4', 'Не удалось отформатировать расширенный раздел 1',
        'Не удалось отформатировать расширенный раздел 2', 'Не удалось отформатировать расширенный раздел 3', 'Не удалось отформатировать расширенный раздел 4', 'Сброс потока обнаружения модуля', 'Поток обнаружения модуля умирает Перезапустить', 'Не удается записать перезапуск', 'Удаленное обновление модуля Tiangong',
        'Обновление модуля Boot Tiangong', 'Тревога ввода-вывода', 'перезапуск по времени', 'Обновление удаленного модуля', 'Удаленный апгрейд модуля', 'Запись карты IC локально', 'Жесткий диск разблокирован', 'жесткий диск заблокирован', 'Платформа не подключена, но может быть пропингована Принудительно перезагрузить модуль',
        'Обновление информации о блокировке сервера', 'исключение потока', 'Не могу нормально загрузиться', 'Не удается корректно завершить работу']
    },

    report: {
        menu: ['Активная отчетность', 'Правила', 'Свойства терминала', 'Сервер', 'Информация об алгоритме', 'Журнал флэш-памяти', 'Статус диска', 'Потеря видео', 'Потеря кадра видео', 'Активно сообщать статистику', 'Конфигурация автоматической загрузки устройства', 'Количество флэш-журналов'],
        data: ['Оригинальная модель', 'Оригинальная версия прошивки', 'интервал сердцебиения', 'SN устройства', 'Mac устройства', 'IMEI', 'ICCID', 'Тип потери кадров', 'Пропадание кадров', 'Ни один кадр не потерян', 'Статья / Страница'],
        update: ['сообщать количество оборудования', 'несообщение о количестве оборудования', 'пропуск кадров', 'пропуск кадров', 'потеря параметров', 'уровень напоминания выбран，ниже необходимо заполнить один из них', 'Информация'],
        event: ['запрос состояния диска', 'запрос на потерю видео', 'журнал flash', 'Статистика пропусков кадров видео', 'журнал журнал журнал', 'количество устройств в строке', 'Статистика оборудования', 'количество неучтенных устройств', 'количество устройств без данных'],
        table: ['итог','статистика','без учета', 'пропуск кадров', 'Выберите устройство', 'аномалия форматирования' ,'аномалия чтения и записи', 'работа на жёстком диске', 'Выберите тип события', 'Перезагрузить', 'эскалация', 'порог кратности', 'запрос информации о устройстве', 'конфигурация активного отчёта'],
        company: ['управление компанией', 'Основная компания', 'Санкционированное количество устройств', 'количество оборудования', 'количество групп', 'номер счета Администратора', 'Название головной компании', 'время создания', 'создатель', 'загружать напоминание', 'неделя', 'Настройка напоминания', 'загружать']
    }
    , historyMap: {
        historyMapTitle: [" траектор информац ", "траектор анализ", "скорост наблюден", "превышен скорост анализ", "ACC состоян", "3G / 4G состоян"]
        ,speedMaxs:"Скорость"
        ,locationInfo:"Местоположение"
        ,carTitle:"Пожалуйста, выберите автомобиль"
        ,tjTab1:"Статистика пробега"
        ,tjTab2:"Статистика трафика"
        ,exportXls:"Экспорт"
        ,content:"Контент"
        ,StartAddress:"Начальный адрес"
        ,EndAddress:"Конечный адрес"
        ,mileageStr:"Пробег"
        ,distance:"Пробег от даты начала"
        ,DateTime:"Дата"
        ,dayFlow:"Поток дня (КБ)"
        ,TotalFlow:"Общий расход"
        ,time:"Время GPS"
        ,longitude:"Долгота"
        ,latitude:"Широта"
        ,direction:"Направление"
        ,night:"Низкая мощность"
        ,gpsosd:"Дополнение"
        ,track:"Информация о треке"
        ,trackCount:"Анализ треков"
        ,speedlin:"Монитор скорости"
        ,speedfx:"Анализ превышения скорости"
        ,accStatus:"Статус ACC"
        ,statusS:"Статус 3G/4G"
        ,startLocation:"Начальное местоположение"
        ,endLocation:"Конечное местоположение"
        ,startTimeStr:"Время начала"
        ,endTimeStr:"Время окончания"
    }
    ,historyPlay:{
         calendarDay:"Дата"
         ,enableCalendar:"Включить календарь"
         ,enableCalendarTime:"Диапазон времени"
         ,avType:"Тип аудио-видео"
         ,tabsPlay:["Видео", "Список файлов", "Загрузка","Загрузка в пользовательское время"]
         ,deleteStr:"Удалить"
         ,avTypeArray:["0@аудио видео","1@аудио","2@видео","3@ключевой информационный кадр","4@все кадры"]
         ,dayTimeStart:"Время начала"
         ,dayTimeEnd:"Время окончания"
         ,dowmTable:["ID устройства","Имя файла","Текущий прогресс","Размер файла","Статус"]
         ,ch:"Канал"
         ,stop:"Отмена"
         ,downformat:"Формат"
         ,status:"Статус"
         ,timeStr: "Время не может быть одинаковым."
        ,timeEndStr: "Время начала не может быть больше времени конца"
        ,downloadStatus: ["","Невозможно подключиться к серверу","Видеосервер не отвечает","Сетевое подключение отключено","Нет видеофайла","Не удалось отправить видеофайл","Не удалось отправить файл изображения", "Устройство занято"]
        ,recResources: "Ресурсы"
    }
    ,exportStr:{
        downloadStr:"результат загрузки"
    },
    imgage: {
        addCar:{
            from:["Гос.Номер","ID устройства","модель оборудования"
                 ,"Версия оборудования","Версия прошивки","Версия MCU","Беспроводной модуль","ADAS","Поиск"],
            table:["Гос.Номер","ID устройства","Компания"
                 ,"Модель терминала","Версия оборудования","Версия ПО","Версия MCU","Wi-Fi","ADAS"]
        },
        title_router: ["Просмотр изображений", "Конфигурация оборудования", "Конфигурация системы"],
        title: ["просмотр изображения", "Правила загрузки", "загрузка изображения"],
        nav: ["Управление видео", "Управление изображениями"],
        operation: ["Добавить", "Изменить", "Удалить", "Конфигурация загрузки фото", "Статистика", "Запрос на добавление фото", "Клонировать", "Поиск", "Присвоить правило", "Достичь"
        ],
        from: ["Тип съемки", "Сервер", "Свойства фото", "Тип даты", "Временной интервал", "Период загрузки",
             "сеть", "Ethernet", "ДОБАВИТЬ", "период захвата", "дата", "временной интервал", "имя"
        ],
        date_select: ["Все даты", "По состоянию на", "Начало в", "Временные рамки"],
        photos_type_select: ["IO1", "IO2", "IO3", "IO4", "IO5", "IO6", "IO7", "IO8"],
        // table: ["Тип фото", "Контент загрузки фото", "Общая комплектация", "Количество отказов", "Количество не возвращено"],
        table: ["Имя политики", "Оператор", "Время работы", "IP операции", "Содержание операции",
             "Связанное общее оборудование", "Успешно установлено", "Настройка не удалась", "Не возвращено", "время начала", "время окончания",
             "поиск"
        ],
        table2: ["Тип фото", "Приоритет загрузки", "Видеоканал", "IO", "Время фото", "Время загрузки", "Проход",
             "кому", "IP/доменное имя", "Сеть"
        ],
        filters: ["IO", "Запись тревоги AI", "Захват скорости", "Усталость вождения", "История в первую очередь", "Приоритет в реальном времени"],
        notify: ["Одновременно можно опрашивать только одно транспортное средство",
             "Успешно установлена правило для сервера распространения", "Сервер распространения успешно изменен",
             "Проверьте хотя бы одно транспортное средство", "Проверьте хотя бы одну конфигурацию", "Копирование конфигурации завершено",
             "Пожалуйста, отметьте один", "Эта операция безвозвратно удалит конфигурацию. Продолжить?",
             "подтвердить", "очистить", "удалить удалось"
        ],
        user: ["Выход", "Вход пользователя"],
        message: ["Одновременно можно удалить только одно", "Одновременно можно изменить только одно",
             "Переключение языка прошло успешно"
        ],
        operation_router: ["Обновить", "Закрыть текущую страницу", "Закрыть все остальные страницы", "Закрыть все страницы"],
        Upload: [""],
        imageVideo: {
            right_time: "Текущее время воспроизведения",
            Start_playing: "Старт",
            End_playing: "Стоп",
            operation: ["Скорость", "Старт", "Таймаут"]
        },
        addImage: {
            tips: ["Имя не может быть пустым", "Тип захвата не может быть пустым", "Выберите хотя бы один элемент"]
        },
        timing: {
            tips: "Правила загрузки",
            table: ["Название полиса", "Номер автомобиля", "Атрибуция", ""],
            Dialog: ["Название полиса", "Выбрано", "Автомобиль", "Название полиса", "Подтвердить", "Очистить", "Введите название полиса"],
            prompt: ["Идентификатор устройства (может быть пустым)", "Советы", "Подтвердить", "Очистить"],
            resource:["по умолчанию", "на заказ"]
        },
        download: {
            time_state: "Выберите время",
            Download: "Скачать",
            Search: "Поиск",
            Picture: "Картина",
            UploadTime: "Время загрузки",
            Capture: "Время тревоги",
            ID: "Номер привязки",
            operation: ["общий", "полоса", "выбрать"],
            suspend:"Приостановить",
            downloadTable:["ID устройства", "имя файла", "размер файла", "прогресс"]
        },
        imgUplateQuery: {
            ViewDetails: "Подробнее"
        },
        popover: {
            Ethernet: "Ethernet"
        },
        statusTable: ["успешно", "неудачно", "не возвращено", "номер автомобиля", "идентификатор устройства", "время приема оборудования"],
        ftpServer: {
            example: "пример",
            userName: "пользователь",
            userPassword: "пароль",
            Enable_server: "Активировать сервер",
            yes: "включить",
            no: "Выключить",
            Search: "Поиск",
            operation_title: "операция",
            look: "Вид",
            name: "Имя сервера",
            Port: "Порт",
            ID: "Число",
            operation: ["Успешно изменено", "Сначала выберите одно",
                 "Эта операция безвозвратно удалит конфигурацию. Продолжить?", "ОК", "Очистить",
                 "Удалось удалить"
            ],
            tips: [ "Порт не может быть пустым", "IP/имя домена не может быть пустым",
                 "Пароль не может быть пустым", "Имя пользователя не может быть пустым"
            ]
        },
        upload: ["FTP-сервер", "Другое"],
        uploadPriority: {
            tips: ["Установить успешно"],
            name: "Приоритетный статус загрузки",
            yes: "включить",
            no: "Выключить"
        },
        ImageVideo: {
            title: "Длительность отображения(секунды) :",
            tabTitle:["Изображение ID устройства", "Ftp-загрузка", "Загрузка медиафайлов", "Ftp-просмотр изображений"],
            imageTable:["ID устройства", "AV", "Тип", "Интервал времени", "Изображение"]
        }
    },
    el: {
        colorpicker: {
            confirm: 'OK',
            clear: 'Очистить'
        },
        datepicker: {
            now: 'Сейчас',
            today: 'Сегодня',
            cancel: 'Отмена',
            clear: 'Очистить',
            confirm: 'OK',
            selectDate: 'Выберите дату',
            selectTime: 'Выберите время',
            startDate: 'Дата начала',
            startTime: 'Время начала',
            endDate: 'Дата окончания',
            endTime: 'Время окончания',
            prevYear: 'Предыдущий год',
            nextYear: 'Следующий год',
            prevMonth: 'Предыдущий месяц',
            nextMonth: 'Следующий месяц',
            year: '',
            month1: 'Январь',
            month2: 'Февраль',
            month3: 'Март',
            month4: 'Апрель',
            month5: 'Май',
            month6: 'Июнь',
            month7: 'Июль',
            month8: 'Август',
            month9: 'Сентябрь',
            month10: 'Октябрь',
            month11: 'Ноябрь',
            month12: 'Декабрь',
            week: 'неделя',
            weeks: {
                sun: 'Вс',
                mon: 'Пн',
                tue: 'Вт',
                wed: 'Ср',
                thu: 'Чт',
                fri: 'Пт',
                sat: 'Сб'
            },
            months: {
                jan: 'Янв',
                feb: 'Фев',
                mar: 'Мар',
                apr: 'Апр',
                may: 'Май',
                jun: 'Июн',
                jul: 'Июл',
                aug: 'Авг',
                sep: 'Сен',
                oct: 'Окт',
                nov: 'Ноя',
                dec: 'Дек'
            }
        },
        select: {
            loading: 'Загрузка',
            noMatch: 'Нет подходящих данных',
            noData: 'Нет данных',
            placeholder: 'Выбрать'
        },
        cascader: {
            noMatch: 'Нет подходящих данных',
            loading: 'Загрузка',
            placeholder: 'Выбрать',
            noData: 'Нет данных'
        },
        pagination: {
            goto: 'Перейти',
            pagesize: '/страниц',
            total: 'Всего {total}',
            pageClassifier: ''
        },
        messagebox: {
            title: 'Сообщение',
            confirm: 'OK',
            cancel: 'Отмена',
            error: 'Неверный ввод'
        },
        upload: {
            deleteTip: 'нажми удалить чтобы удалить',
            delete: 'Удалить',
            preview: 'Предварительный просмотр',
            continue: 'Продолжить'
        },
        table: {
            emptyText: 'Нет данных',
            confirmFilter: 'Подтвердить',
            resetFilter: 'Перезагрузить',
            clearFilter: 'Все',
            sumText: 'Сумма'
        },
        tree: {
            emptyText: 'Нет данных'
        },
        transfer: {
            noMatch: 'Нет подходящих данных',
            noData: 'Нет данных',
            titles: ["Список 1", "Список 2"], // to be translated
            filterPlaceholder: 'Введите ключевое слово', // to be translated
            noCheckedFormat: '{total} Предметов', // to be translated
            hasCheckedFormat: '{checked}/{total} проверенных' // to be translated
        },
        image: {
            error: 'НЕ УДАЛОСЬ'
        },
        pageHeader: {
            title: 'Назад' // to be translated
        },
        popconfirm: {
            confirmButtonText: 'Да',
            cancelButtonText: 'Нет'
        }
    }
    ,versionList:{
        workName: "прекращено",
        workDeleteTitle: "то, что миссия была остановлена, не может быть удалено ",
        calibrationTitle:"Calibration"
        ,fCarWidthStr:"Body width"
        ,fRefCenter:"Distance camera to vehicle left"
        ,fCameraHeight:"Camera installation height"
        ,fRefTop:"Distance camera to the head stock"
        ,save:"Save"
        ,cameraType:"Camera type"
        ,cameraLoc:"Camera installation location"
        ,fFirstWarnDistanceStr:"First class alarm distance"
        ,fSecondWarnDistance:"Second level alarm distance"
        ,fThirdWarnDistance:"Three alarm distance"
        ,fCameraDx:"sensor size(unit cell size)"
        ,camej:"Camera focal length"
        ,rightBtn:"Associate right turn"
        ,strFishEye:["normal camera","super wide-angle camera"]
        ,strLoc:["Front", "Right Front", "Right Back", "Left Front"]
        ,limitStr1:["Level 1 is limited to 0cm-400cm","Level 2 is limited to 0cm-400cm","Level 3 is limited to 0cm-400cm"]
        ,locationStr:["direction","minimum speed","maximum speed"]
        ,locationArrayStr:["Right","Front","Back ","Feft"]
        ,speed:"Speed of simulation"
        ,speedDesc:"Speed limit at [1-120]"
        ,calibration:"Calibration"
        ,parameter:"Parameter"
        ,closeCalibration:"closeCalibration"
        ,selectCar: "Please select a car"
        ,idSelect: "Device ID is being calibrated. Do you want to switch?"
        ,deviceName: [" Current calibration device ", "Please select device remote calibration "]
        ,titleUpdateStatus: ["operator", "operation time", "policy name", "policy content", "associated device", "delivered", "success", "upgrading", "failure", "not Issued","Not online","Low power consumption","стратег","Стратегический уровень."]
        ,titleUpdateStatusDesc:["serial number", "license plate number", "device ID", "delivery time", "return time", "download completion time", "upgrade status", "failure reason", "version number before upgrade ","Upgraded version number"]
        ,timeTitleCreate: "Создать новое время"
        ,updateStatus: ["", "Загрузка микропрограммы", "Загрузка микропрограммы выполнена успешно", "Сбой загрузки микропрограммы", "Установка микропрограммы", "Обновление выполнено успешно", "Обновление не выполнено", "Целевое устройство не найдено", "Модель оборудования не поддерживается", "Та же версия ПО", "Неподдерживаемая версия ПО", "Превышен лимит обновлений", "Отключение ACC", "Недостаточно памяти", "Объединение политик", "Срок действия политики истек", "Удаление политики", "Сравнение версий успешно" , "Другие","Другие"]
        , updateType: "тип обновления"
        ,versionNumber: "номер версии"
        ,updateFileName: "Имя файла"
        ,deadLinestr: "Срок действия"
        ,versionCalibration: ["ADAS", "DSM", "HOD", "BSD", "BSD2", "BSD3"]
        ,versionTreeLabel: ["Обновление устройства", "Блокировка устройства", "Блокировка сервера", "Изменить сервер", "Удаленная калибровка", "Запись устройства", "Информация о диске", "Умная информация", "Состояние диска", "Запись Информация»","«Запись потеряна»", "«Запись потерянного кадра»", "«Журнал флэш-памяти»", "«Запрос журнала»"],
        GradeStr: ["9@ низкий ", "5@ из 5 ", "1@ высокий "]
    }
    //查询设备连接服务器状态
    , deviceInfo: {
        title: 'Подключение устройств',
        table: ['Серийный номер платформы ', 'Состояние соединения', 'Причины неудачи', 'Точка вопроса', 'Время обновления', 'Состояние соединения',
            'Количество платформ с неудачным подключением', 'Пожалуйста, выберите машину слева.'],
        info: ['Подключение успешно', 'Неверное GPS', 'Эффективное GPS', 'Не включено', 'Нет', 'Неверный', 'Конфликт соединений', 'Подключено', 'Ошибка регистрации',
            'Ошибка отправки зарегистрированного сообщения, фактическая длина данных не совпадает с длиной данных, отправленных обратно',
            'Ошибка подключения платформы', 'Ошибка интерпретации доменного имени сервера платформы', 'Ошибка параметров проверки функции', 'АК успешно', 'Автомобиль зарегистрирован.',
            'Автомобиль отсутствует в базе данных', 'Терминал зарегистрирован.', 'Терминал отсутствует в базе данных', 'Ожидание ответа',
            'Время ожидания ответа платформы на зарегистрированное сообщение истекло', 'Запись данных из Socket. Ошибка Recv.',
            'Поступили другие сообщения, так и не получили ответа.', 'Ошибка ответа платформы на зарегистрированное сообщение', 'Ошибка проверки',
            'Ошибка отправки сообщения, несоответствие между фактической длиной данных и длиной данных, отправленных обратно', 'Ошибка Socket', 'Права успешно',
            'Время ожидания ответа платформы истекло.', 'Socket прослушивает данные, а Recv не работает.',
            'Я получил другие сообщения, но не получил ответа.', 'Платформа отвечает на вопросы, но сообщение неверно.', 'Идентификатор сообщения ответа платформы не совпадает',
            'Ожидание многоцентровой платформы.', 'Активное отключение устройства', 'Ошибка получения сообщения автоматически отключается', 'Время ожидания ответа на сообщение отключено',
            'Ошибка получения сообщения Socket', 'Ошибка отправки сообщения отключена', 'Ошибка подключения платформы JT905',
            'Отправка 0200 Проверьте, не совпадают ли ссылки, ошибка отправки сообщения, фактическая длина данных и длина данных, отправленных обратно',
            'Регистрация завершена', 'Время ожидания ответа платформы 0200', 'Запись данных в Socket не удалась', 'Поступили другие сообщения, так и не получили ответа на 0200.',
            'Платформа отвечает на сообщения 0200 ID не совпадает'],
        limit: ['Активная безопасность', 'Настройка видео', 'Настройка изображения', 'Настройка отчетности', 'Хранить сервер', 'Отчет об активной безопасности', 'Статистика распространения текстов',
                'Отчет о модернизации оборудования', 'Вверх и вниз', 'Отчет о блокировке устройства', 'Загрузка отчетов FTP',
            'Видеоматериалы оборудования', 'Статистика журнала устройств', 'Статистика параметров оборудования', 'Статистика неисправного оборудования']
    }
}